
&НаКлиенте
Процедура Обр(Команда)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	БольшаяЯчеистаяСборка.Ссылка
	|ИЗ
	|	Документ.БольшаяЯчеистаяСборка КАК БольшаяЯчеистаяСборка
	|ГДЕ
	|	БольшаяЯчеистаяСборка.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",Объект.Дата1 );
	Запрос.УстановитьПараметр("Дата2",Объект.Дата2 );
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка.МестаОтгрузки.Количество()=0 тогда
			Если Выборка.Ссылка.Направление.Код<>"100" тогда
				ОБД=Выборка.Ссылка.ПолучитьОбъект();
				Если ОБД.Коробки=0 Тогда 
					ОБД.Коробки=1;
				КонецЕсли;	
				Стр=ОБД.МестаОтгрузки.Добавить();
				Стр.КоличествоКоробок=1;
				Стр.МестоОтгрузки=Справочники.МестаХранения.НайтиПоКоду("000001001");
				ОБД.Записать(РежимЗаписиДокумента.Проведение) ;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры
