
&НаКлиенте
Процедура ПечатьШК(Команда)
	ТабличныйДокумент = ПечатнаяФорма();
	
	Если ТабличныйДокумент <> Неопределено Тогда
		ТабличныйДокумент.Показать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция  ПечатнаяФорма() 
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	
	Макет = Обработки.ПроизвольнаяПечатьШК.ПолучитьМакет("Макет");
	Область1 = Макет.ПолучитьОбласть("Шапка");
	Область1.Параметры.ПроизвольныйТекст = Объект.ПроизвольныйТекст;
	КартинкаШтрихкода = ОбщийМодуль_Каштан.ПолучитьКартинкуШтрихкода(Объект.ШК, 100, 90);
	Рисунок = Область1.Область("ШК1");
	Рисунок.Картинка = КартинкаШтрихкода;
	ТабличныйДокумент.Вывести(Область1);
	Возврат ТабличныйДокумент;
КонецФункции	


