

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если Не мВозврат Тогда
		
		
		// Списываем По БЯС с 22,11,2013 только если есть остатки
		
		//Проверяем наличие остатков по ДокБЯС
		ДокБЯС=ДокументОснование.ПолучитьОбъект();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗонаОтгрузкиОстатки.ДокументПрихода,
		|	ЗонаОтгрузкиОстатки.КоличествоКоробокОстаток
		|ИЗ
		|	РегистрНакопления.ЗонаОтгрузки.Остатки(, ДокументПрихода = &ДокБЯС) КАК ЗонаОтгрузкиОстатки
		|ГДЕ
		|	ЗонаОтгрузкиОстатки.КоличествоКоробокОстаток > 0";
		
		Запрос.УстановитьПараметр("ДокБЯС", ДокБЯС.Ссылка);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			
			
			
			//---- Если Остатки Есть - ПРОВОДИМ--//
			Движения.ЗонаОтгрузки.Записывать	= Истина;
			ДокБЯС=ДокументОснование.ПолучитьОбъект();
			Для Каждого ТекСтрока Из ДокБЯС.МестаОтгрузки Цикл
				
				Движение = Движения.ЗонаОтгрузки.Добавить();
				Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
				Движение.Период				= Дата;
				Движение.ДокументПрихода	= ДокументОснование;
				Движение.НомерМестаОтгрузки	= ТекСтрока.МестоОтгрузки;
				Движение.КоличествоКоробок	= ТекСтрока.КоличествоКоробок;
				//Движение.Вес				= ТекСтрока.Вес;
				//Движение.Объем				= ТекСтрока.Объем;
				
			КонецЦикла;
			
			
		КонецЕсли;
		
		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
КонецПроцедуры


Процедура ПередУдалением(Отказ)
	//Удалим ссылки в БЯС
	Попытка
		ДокБЯС=ЭтотОбъект.ДокументОснование.ПолучитьОбъект();
		ДокБЯС.ПогрузкаВАвто="";
		ДокБЯС.Записать(РежимЗаписиДокумента.Запись);
	Исключение
	КонецПопытки;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//Cсылки в БЯС
	
	модСерверПолныеПрава.РедактироватьПогрузкуВАвтоВБЯС(Ссылка);
	//Попытка
	//	ДокБЯС=ЭтотОбъект.ДокументОснование.ПолучитьОбъект();
	//	Если Не ЗначениеЗаполнено(ДокБЯС.ПогрузкаВАвто) Тогда
	//	ДокБЯС.ПогрузкаВАвто=Ссылка;
	//	ДокБЯС.Записать(РежимЗаписиДокумента.Запись);
	//	КонецЕсли;
	//Исключение
	//КонецПопытки;
КонецПроцедуры

