////////////////////////////////////////////////////////////////////////
// Модуль поддерживает работу с хранилищем общих настроек

// Загрузка параметров подключения драйвера сканера из хранилища настроек. 
// 
// Параметры: 
//  ТипОС           – Строка – тип операционной системы.  (IN)
// 
// Возвращаемое значение: 
//  Структура, содержащая параметры подключения сканера
Функция ЗагрузитьПараметрыПодключенияСканера(ТипОС) Экспорт
	
	Если ТипОС = "Windows" Тогда
		
		Возврат ХранилищеОбщихНастроек.Загрузить("ТекущиеНастройкиСканераWindows");
		
	ИначеЕсли ТипОС = "Linux" Тогда
		
		Возврат ХранилищеОбщихНастроек.Загрузить("ТекущиеНастройкиСканераLinux");
		
	КонецЕсли;
	
КонецФункции

// Получение каталога, используемого для расположения локальных файлов
// Возвращаемое значение: 
//  Строка, содержащая каталог
Функция ПолучитьРабочийКаталог() Экспорт
	
	Возврат ХранилищеОбщихНастроек.Загрузить("РабочийКаталогПользователя");
	
КонецФункции

// Сохранение каталога, используемого для расположения локальных файлов
// Параметры: 
//  Строка, содержащая каталог
Процедура СохранитьРабочийКаталог(Каталог) Экспорт
	
	ХранилищеОбщихНастроек.Сохранить("РабочийКаталогПользователя",,Каталог);	
	
КонецПроцедуры

