
&НаСервере
Процедура ПрочитатьНаСервере()
	//steam-soft.com kund 30.04.2018 { 
	//УстановитьПривилегированныйРежим( Истина );
	//steam-soft.com kund 30.04.2018 } 
	
	выбПараметры = "Srvr=""192.168.66.51"";Ref=""sklad1s"";Usr=""BotIt"";Pwd=""123""";;
	V83COMConnector= Новый COMОбъект("V83.Application");
	
	Попытка                           
		База= V83COMConnector.Connect(выбПараметры);
		База=V83COMConnector;
		
	Исключение
		Сообщить ("Ошибка подключения!");
		Сообщить(ОписаниеОшибки());
		Возврат ;
	КонецПопытки;
	 Возврат ;
	стр = "";
	сч = 0;
	
	Если сч=0 Тогда 
		Сообщить(стр);
	Иначе
		Сообщить("Загружено "+сч+" объектов");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Прочитать(Команда)
	ПрочитатьНаСервере();
КонецПроцедуры
