
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.АктПриемаПередачиТМЦ.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АктПриемаПередачиТМЦ.ГосНомер,
	|	АктПриемаПередачиТМЦ.ДатаОтправки,
	|	АктПриемаПередачиТМЦ.МаркаМашины,
	|	АктПриемаПередачиТМЦ.НомерТелефона,
	|	АктПриемаПередачиТМЦ.ФИОВодителя,
	|	АктПриемаПередачиТМЦ.Направление.(
	|		Номер,
	|		Город,
	|		Получатель,
	|		НомерСчетФатуры,
	|		ДатаДок,
	|		ВсегоМест,
	|		Палета,
	|		Обьем,
	|		Вес,
	|		СуммаОтгрузки,
	|		Организация
	|	)
	|ИЗ
	|	Документ.АктПриемаПередачиТМЦ КАК АктПриемаПередачиТМЦ
	|ГДЕ
	|	АктПриемаПередачиТМЦ.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНаправлениеШапка = Макет.ПолучитьОбласть("НаправлениеШапка");
	ОбластьНаправление = Макет.ПолучитьОбласть("Направление");
	ОбластьИтог=Макет.ПолучитьОбласть("Итог");
	ОбластьПодвал=Макет.ПолучитьОбласть("Подвал2");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
        ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ТабДок.Вывести(ОбластьНаправлениеШапка);
		ВыборкаНаправление = Выборка.Направление.Выбрать();
		СуммаИтог=0;
		СуммаОбьем=0;
		СуммаВес=0;
		СуммаИтогСумма=0;
		Пока ВыборкаНаправление.Следующий() Цикл
			ОбластьНаправление.Параметры.Заполнить(ВыборкаНаправление);
			ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
			ТабДок.Вывести(ОбластьНаправление, ВыборкаНаправление.Уровень());
			СуммаИтог=СуммаИтог+ВыборкаНаправление.ВсегоМест;
			СуммаОбьем=СуммаОбьем+ВыборкаНаправление.Обьем;
			СуммаВес=СуммаВес+ВыборкаНаправление.Вес;
			СуммаИтогСумма=СуммаИтогСумма+ВыборкаНаправление.СуммаОтгрузки;
		КонецЦикла;
		ОбластьИтог.Параметры.ИтогМест=СуммаИтог;
		ОбластьИтог.Параметры.ИтогОбьем=СуммаОбьем;
		ОбластьИтог.Параметры.ИтогВес=СуммаВес;
		ОбластьИтог.Параметры.ИтогСумма=СуммаИтогСумма;
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДок.Вывести(ОбластьИтог);
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДок.Вывести(ОбластьПодвал);
		
		

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры


