
&НаКлиенте
Процедура Обзор(Команда)
	//АдресВХранилище="";
	//ВыбранноеИмяФайла="";
	//ПоместитьФайл(АдресВХранилище, , ВыбранноеИмяФайла, Истина); 
	//Путь= ВыбранноеИмяФайла;
	
	Д=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Д.МножественныйВыбор=Ложь;
	Фильтр = "'Внешние обработки'"+"(*.epf)|*.epf";
    Д.Фильтр=Фильтр;
	Д.Выбрать();
	Путь=Д.ПолноеИмяФайла;
КонецПроцедуры


&НаКлиенте
Процедура ЗапуститьОбработку(Команда)
	//ВО=ВнешниеОбработки.Подключить(Путь);
	//ОткрытьЗначение(ВО);
	
	АдресВХранилище="";
	ПоместитьФайл(АдресВХранилище,Путь , , Ложь); 
    Сообщить(АдресВХранилище);
	ИмяВнешнейОбработки=ПодключитьВОСервер(АдресВХранилище);	
	ОткрытьФорму("ВнешняяОбработка."+ИмяВнешнейОбработки+".Форма");	

КонецПроцедуры


&НаСервере
Функция  ПодключитьВОСервер(АдресВХранилище)
	ИмяВнешнейОбработки=ВнешниеОбработки.Подключить(АдресВХранилище,,Ложь);	
	Возврат ИмяВнешнейОбработки;	
КонецФункции
