
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.БольшаяЯчеистаяСборка.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БольшаяЯчеистаяСборка.Дата,
	|	БольшаяЯчеистаяСборка.ДВСоздания,
	|	БольшаяЯчеистаяСборка.Номер,
	|	БольшаяЯчеистаяСборка.НомераСФ,
	|	БольшаяЯчеистаяСборка.Организация,
	|	БольшаяЯчеистаяСборка.Получатель,
	|	БольшаяЯчеистаяСборка.ДокументыРасхода.(
	|		Док,
	|		СчетФ,
	|		ШК,
	|		ДокНомер
	|	),
	|	БольшаяЯчеистаяСборка.МестаОтгрузки.(
	|		НомерСтроки,
	|		МестоОтгрузки,
	|		КоличествоКоробок
	|	)
	|ИЗ
	|	Документ.БольшаяЯчеистаяСборка КАК БольшаяЯчеистаяСборка
	|ГДЕ
	|	БольшаяЯчеистаяСборка.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьДокументыРасходаШапка = Макет.ПолучитьОбласть("ДокументыРасходаШапка");
	ОбластьДокументыРасхода = Макет.ПолучитьОбласть("ДокументыРасхода");
	ОбластьМестаОтгрузкиШапка = Макет.ПолучитьОбласть("МестаОтгрузкиШапка");
	ОбластьМестаОтгрузки = Макет.ПолучитьОбласть("МестаОтгрузки");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьДокументыРасходаШапка);
		ВыборкаДокументыРасхода = Выборка.ДокументыРасхода.Выбрать();
		Пока ВыборкаДокументыРасхода.Следующий() Цикл
			ОбластьДокументыРасхода.Параметры.Заполнить(ВыборкаДокументыРасхода);
			//ШК
			КартинкаШтрихкода = ОбщийМодуль_Каштан.ПолучитьКартинкуШтрихкода(СокрЛП(ВыборкаДокументыРасхода.ШК)+"0", 100, 90,Ложь);
			Рисунок = ОбластьДокументыРасхода.Область("ШК1");
			Рисунок.Картинка = КартинкаШтрихкода;

			//------------
			
			ТабДок.Вывести(ОбластьДокументыРасхода, ВыборкаДокументыРасхода.Уровень());
		КонецЦикла;

		//ТабДок.Вывести(ОбластьМестаОтгрузкиШапка);
		//ВыборкаМестаОтгрузки = Выборка.МестаОтгрузки.Выбрать();
		//Пока ВыборкаМестаОтгрузки.Следующий() Цикл
		//	ОбластьМестаОтгрузки.Параметры.Заполнить(ВыборкаМестаОтгрузки);
		//	ТабДок.Вывести(ОбластьМестаОтгрузки, ВыборкаМестаОтгрузки.Уровень());
		//КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		//ТабДок.Вывести(Подвал);

		//ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
