&НаСервере
Процедура ПередатьПутевойЛист(Док) Экспорт 
	
	ВыгрузкаДок(Док);
	
КонецПроцедуры
&НаСервере
Функция ВыгрузкаДок(ДокСсылка) Экспорт
	   СтрокаСоединения=Константы.СтрокаСоединенияСБазойТМС.Получить();
	   V8=New COMОбъект("V83.COMConnector");
	   //ДокОбъект=ДокСсылка.ПолучитьОбъект();
	   
		conn=V8.Connect(СтрокаСоединения);
		   ДокПоиск=conn.Документы.ПутевойЛист_2.НайтиПоНомеру(ДокСсылка.Номер,ДокСсылка.Дата);
		   Если ДокПоиск<>conn.Документы.ПутевойЛист_2.ПустаяСсылка() Тогда
			   НовыйДок=ДокПоиск.ПолучитьОбъект();
		   Иначе	
			   НовыйДок=conn.Документы.ПутевойЛист_2.СоздатьДокумент();
			   НовыйДок.Номер=ДокСсылка.Номер;
		   КонецЕсли;
		   //ПоискКонтрагента=conn.Справочники.упКонтрагенты.НайтиПоКоду(ДокСсылкаПолучатель.Код);
		   //Если ПоискКонтрагента<>conn.Справочники.Контрагенты.ПустаяСсылка() Тогда
		   //    Контрагент=ПоискКонтрагента;
		   //Иначе
		   //    Возврат 0; 
		   //КонецЕсли;
		   НовыйДок.Дата=ДокСсылка.Дата;
		   НовыйДок.Водитель=conn.Справочники.упСотрудники.НайтиПоРеквизиту("МобТелефон",ДокСсылка.Водитель.Телефон);
		   
		   //НовыйДок.Водитель=Водитель;
		   //НовыйДок.Автомобиль=Автомобиль;
		   //НовыйДок.КоличествоМест=Автомобиль;
		   
		   НовыйДок.Данные.Очистить();
		   Для Каждого СтрокаТЧ Из ДокСсылка.Данные Цикл
			   НоваяСтрокаТЧ=НовыйДок.Данные.Добавить();
			   НоваяСтрокаТЧ.Клиент=conn.Справочники.упКонтрагенты.НайтиПоКоду(СтрЗаменить(СтрокаТЧ.ДокументПрихода.Получатель.Код,"ХЗ",""));
			   НоваяСтрокаТЧ.НомераСФ=СтрокаТЧ.ДокументПрихода.НомераСФ;
			   
		   КонецЦикла;
		   НовыйДок.Записать(conn.РежимЗаписиДокумента.Проведение);
		   Возврат Истина;
   КонецФункции
