
&НаКлиенте
Процедура СкомплектоватьПутевойЛИСТ(Команда)
Если Вопрос("Сруппировать Клиентов В Путевои Листе?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда	
	Возврат;
КонецЕсли;

ДокПЛ=Элементы.Список.ТекущиеДанные.Ссылка;
модСерверПолныеПрава.СкомплектоватьПутевойЛист(ДокПЛ);

КонецПроцедуры

&НаКлиенте
Процедура РазобратьКомплектыВПутевомЛисте(Команда)
	Если Вопрос("Разобрать комплекты В Путевои Листе?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда	
	Возврат;
КонецЕсли;

ДокПЛ=Элементы.Список.ТекущиеДанные.Ссылка;
модСерверПолныеПрава.РазобратьКомплектыВПутевомЛисте(ДокПЛ);

КонецПроцедуры
