
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекстКоманды="Сканируйте путевой лист";
КонецПроцедуры
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если НЕ ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	      
	
	Если Источник = "СканерШтрихкода" И Событие = "Barcode" И ЗначениеЗаполнено(Данные) Тогда
		ШК = Данные;	
		 Если ЗначениеЗаполнено(ШК) Тогда
			 //Поиск Возвратной СчетФ
			 ШКПриИзменении(Элементы.ШК); 			  
		 КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ШКПриИзменении(Элемент)
	//ШКПриИзмененииСЕРВЕР();
	Если Лев(ШК,3)="0WS" и ТекстКоманды="Сканируйте путевой лист" тогда 
		
		ШКДок = Прав(ШК,9);
		ПутевойЛист=НайтиДокументПоШК(ШКДок);
		Если ЗначениеЗаполнено(ПутевойЛист) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Мативация.Ссылка
			|ИЗ
			|	Документ.Мативация КАК Мативация
			|ГДЕ
			|	Мативация.ПутевойЛист = &ПутевойЛист
			|	И Мативация.Дата > &Дата";
			
			Запрос.УстановитьПараметр("ПутевойЛист",ПутевойЛист );
			Запрос.УстановитьПараметр("Дата",НачалоГода(ТекущаяДата()));
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			Если Выборка.Количество() > 0 тогда
				Пока Выборка.Следующий() Цикл
					Инфа="Мотивация на Путевой лист №"+ Выборка.Ссылка.ПутевойЛист.Номер + " уже записана"; 
					ПутевойЛист="";
				КонецЦикла;
			Иначе
				ТекстКоманды="Сканируйте свой ШК"
			КонецЕсли;
		Иначе
			Инфа="Документ не найден.";
		КонецЕсли;
	ИначеЕсли Лев(ШК,3)="SOT" и ТекстКоманды="Сканируйте свой ШК" тогда
		Сотрудник=ШК;
		ТекстКоманды="Сканируйте путевой лист";
		Док= Документы.Мативация.СоздатьДокумент();
		Док.Дата=ТекущаяДата();
		Док.ПутевойЛист=ПутевойЛист;
		Док.Сотрудник=Сотрудник;
		Док.Клиентов=ПутевойЛист.Данные.Количество();
		Док.Записать(РежимЗаписиДокумента.Проведение) ;
		ТекстКоманды="Сканируйте путевой лист";
		Сотрудник="";
		ПутевойЛист="";
		Инфа="Мативация на " + Док.ПутевойЛист +"   Записана на "+ Сотрудник ;
	КонецЕсли;
КонецПроцедуры
		  
&НаСервере
Процедура ШКПриИзмененииСЕРВЕР()
КонецПроцедуры
&НаКлиенте
Функция НайтиДокументПоШК(НомДок)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПутевойЛист_2.Ссылка
	               |ИЗ
	               |	Документ.ПутевойЛист_2 КАК ПутевойЛист_2
	               |ГДЕ
	               |	ПутевойЛист_2.Номер = &Номер
	               |	И ПутевойЛист_2.Дата > &Дата";
	
	Запрос.УстановитьПараметр("Номер",НомДок);
	Запрос.УстановитьПараметр("Дата",НачалоГода(ТекущаяДата()));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ПЛ="";
	Пока Выборка.Следующий() Цикл
		ПЛ=Выборка.Ссылка;
	КонецЦикла;
	Возврат ПЛ ;
КонецФункции
