
&НаКлиенте
Процедура Обновить(Команда)
	ТД.Очистить();
	Макет=Отчеты.ОтчетПоАвто.ПолучитьМакет("Макет");
	Шапка=Макет.ПолучитьОбласть("Шапка");
	Стр=Макет.ПолучитьОбласть("Стр");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВъездВыездАвтомобилей.Дата,
	|	ВъездВыездАвтомобилей.Кому,
	|	ВъездВыездАвтомобилей.Поставщик,
	|	ВъездВыездАвтомобилей.Жетон,
	|	ВъездВыездАвтомобилей.МаркаАвтомобиля,
	|	ВъездВыездАвтомобилей.ДатаВремяВъезда,
	|	ВъездВыездАвтомобилей.ДатаВремяВыезда
	|ИЗ
	|	Документ.ВъездВыездАвтомобилей КАК ВъездВыездАвтомобилей
	|ГДЕ
	|	ВъездВыездАвтомобилей.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Отчет.Дата)-8*60*60 );
	Запрос.УстановитьПараметр("Дата2",КонецДня(Отчет.Дата)+8*60*60 );
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Шапка.Параметры.Дата=Отчет.Дата;
	ТД.Вывести(Шапка);
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Жетон) тогда
			
			Стр.Параметры.Подразделение=Выборка.Кому;
			Стр.Параметры.Поставщик=Выборка.Поставщик;
			Стр.Параметры.Карта=Выборка.Жетон;                  
			Стр.Параметры.Марка=Выборка.МаркаАвтомобиля;
			Стр.Параметры.Въезд=Формат(Выборка.ДатаВремяВъезда,"ДЛФ=В");
			Если не ЗначениеЗаполнено(Выборка.ДатаВремяВыезда) тогда
				Стр.Параметры.Выезд="????";
				Стр.Параметры.Ожидание="????";
			Иначе 
				Стр.Параметры.Выезд=Формат(Выборка.ДатаВремяВыезда,"ДЛФ=В");
				Ож=Выборка.ДатаВремяВыезда - Выборка.ДатаВремяВъезда ;
				ЧЧ=Цел(Ож/3600);
				МИН=Цел( (Ож-ЧЧ*3600)/60) ;
				Если ЧЧ=0 тогда
					Стр.Параметры.Ожидание=Строка(МИН)+" мин.";
				Иначе 
					Стр.Параметры.Ожидание=Строка(ЧЧ)+ "ч. "+МИН+" мин.";
				КонецЕсли;
			КонецЕсли;
			
			ТД.Вывести(Стр); 
		КонецЕсли;
	КонецЦикла;
	
	// Вставить содержимое обработчика.
КонецПроцедуры
