
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка=Справочники.СообщенияПользователям.ПустаяСсылка() Тогда
		Объект.ДатаНачала=ТекущаяДата();
		Объект.Активность=Истина;
		Объект.ИнтервалОтправки=60;
		Объект.КоличествоПовторов=3;
		Объект.ВидСообщения="Предупреждение";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ИнтервалОтправки  <60 Тогда
		Сообщить("ИнтервалОтправки не может быть меньше 60 сек.");	
		Отказ=Истина;
	КонецЕсли;
КонецПроцедуры
