
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если НЕ ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	      
	
	Если Источник = "СканерШтрихкода" И Событие = "Barcode" И ЗначениеЗаполнено(Данные) Тогда
		ШК = Лев(Данные, СтрДлина(Данные) - 1);	
		 Если ЗначениеЗаполнено(ШК) Тогда
			 //Поиск Возвратной СчетФ
			 ШКПриИзменении(Элементы.ШК); 			  
		 КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция  НайтиДокументПоШК(ШК)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратнаяСчетФактура.Ссылка
		|ИЗ
		|	Документ.ВозвратнаяСчетФактура КАК ВозвратнаяСчетФактура
		|ГДЕ
		|	ВозвратнаяСчетФактура.ШК = &ШК
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВозвратнаяСчетФактура.Дата УБЫВ";

	Запрос.УстановитьПараметр("ШК", ШК);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат  ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

	

КонецФункции

&НаКлиенте
Процедура ШКПриИзменении(Элемент)
     ШКПриИзмененииСЕРВЕР();
 КонецПроцедуры
		  
&НаСервере
Процедура ШКПриИзмененииСЕРВЕР()
	//ШКДок = Лев(ШК, СтрДлина(ШК) - 1);
	ШКДок = ШК;
	Док=НайтиДокументПоШК(ШКДок);
			  Если ЗначениеЗаполнено(Док) Тогда
				 //Документ Найден
				
				 //Приемка диспетчером только если есть на месте отгрузки
				 проверкаОстатков=модСерверПолныеПрава.ПроверитьОстаткиПоКлиенту(Док.Получатель);
				 Если проверкаОстатков<>Неопределено Тогда
					 Если ЗначениеЗаполнено(Док.ДВПриемаДиспетчером) Тогда
						 Сообщить("Документ СФ - "+Док.НомерСчетфактуры + " уже принят ДИСПЕТЧЕРОМ.");	 
					 Иначе	 
						 ДокОбъект=Док.ПолучитьОбъект();
						 ДокОбъект.ДВПриемаДиспетчером=ТекущаяДата();
						 ДокОбъект.Диспетчер=ИмяПользователя();
						 ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
						 Сообщить("УСПЕШНО. Документ найден СФ - "+Док.НомерСчетфактуры + " и принят ДИСПЕТЧЕРОМ");
					 КонецЕсли;
				 Иначе
					Сообщить("ОТКАЗАНО! Нет Клиентов в зоне отгрузки.");
				 КонецЕсли;
			 
			 Иначе
				 Сообщить("ОШИБКА! Документ не найден.");
			  КонецЕсли;

			  Элементы.ВозвратныеСФнеПринятыеДиспетчером.Обновить();
			  Элементы.ВозвратныеСФПринятыеДиспетчером.Обновить();
			  Элементы.ВозвратныеСФПринятыеСТАРШИМВОДИТЕЛЕМ.Обновить();
			  
КонецПроцедуры

&НаКлиенте
Процедура УбратьОтметкуТекущейСтроки()
			//Элементы.ВозвратныеСФнеПринятыеДиспетчером.ТекущаяСтрока=-1;
			//  Элементы.ВозвратныеСФПринятыеДиспетчером.ТекущаяСтрока=-1;
			//  Элементы.ВозвратныеСФПринятыеСТАРШИМВОДИТЕЛЕМ.ТекущаяСтрока=-1;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УбратьОтметкуТекущейСтроки();
КонецПроцедуры
