
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ДвижениеТарыАптека.Записывать = Истина;
	Движения.ДвижениеТарыВодитель.Записывать = Истина;
	Движения.ДвижениеТарыПоШК.Записывать = Истина;
	Для каждого Стр Из Тара Цикл
		Движение = Движения.ДвижениеТарыПоШК.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.УКого = Водитель;
		Движение.Тара = Стр.Контейнер;
		Движение.Клиент = Клиент;
		Движение.Кол = 1;
		Движение = Движения.ДвижениеТарыПоШК.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.УКого = "3. В Аптеке";
		Движение.Тара = Стр.Контейнер;
		Движение.Клиент = Клиент;
		Движение.Кол = 1;
		
		Движение = Движения.ДвижениеТарыВодитель.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.УКого =Водитель ;
		Движение.Тара = Стр.Контейнер;
		Движение.Кол = 1;
		Движение.Клиент =Клиент ;
		
		Движение = Движения.ДвижениеТарыАптека.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.УКого = "В Аптеке";
		Движение.Тара = Стр.Контейне;
		Движение.Кол = 1;
		Движение.Клиент =Клиент ;
	КонецЦикла;
КонецПроцедуры
