&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущийЭлемент=Элементы.ШК 
КонецПроцедуры
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если НЕ ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	Если Источник = "СканерШтрихкода" И Событие = "Barcode" И ЗначениеЗаполнено(Данные) Тогда
		ШК = Данные;	
		Если ЗначениеЗаполнено(ШК) Тогда
			Если ЗначениеЗаполнено(СокрЛП(ШК)) Тогда
					ПриИзмененииШК(ШК);
			Иначе
				Сообщить("Введите Штрих Код!",СтатусСообщения.ОченьВажное);
			КонецЕсли;
		ИначеЕсли Источник <> "СканерШтрихкода" И Событие = "Barcode" И ЗначениеЗаполнено(Данные) Тогда
			Сообщить("Сканер Штрих кода не подключен! Устраните неполадку!");		
		ИначеЕсли Источник = "СканерШтрихкода" И Событие = "Barcode" И НЕ ЗначениеЗаполнено(Данные) Тогда
			Сообщить("Сканер не может считать данные.");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ШКПриИзменении(Элемент)
	ШК=Объект.ШК;
	ПриИзмененииШК(ШК) ;
КонецПроцедуры
&НаКлиенте
Процедура ПриИзмененииШК(ШК)
	Объект.ШК = ШК;
	ШКВодитель=СокрЛП(Объект.ШК);
	//Ищем ШКВодителя
	
	Водитель=модСерверПолныеПрава.НайтиФизЛицоПоШк(ШКВодитель,"Водитель");
	Если ЗначениеЗаполнено(Водитель) Тогда
		Объект.Водитель=Водитель;
	Иначе 	
		Если Лев(Объект.ШК,3)="KON" Или Лев(Объект.ШК,3)="kon" Или Лев(Объект.ШК,3)="ЛЩТ"  Или Лев(Объект.ШК,3)="лщт"  тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Тара.Ссылка
			|ИЗ
			|	Справочник.Тара КАК Тара
			|ГДЕ
			|	Тара.ШК = &ШК";
			
			Запрос.УстановитьПараметр("ШК",Объект.ШК );
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			Если Выборка.Количество()>0 Тогда 
				Выборка.Следующий();
				С=0;  ТТ= Выборка.Ссылка;
				Для каждого Стр Из Объект.Тара Цикл
				    Если  Стр.Контейнер = ТТ  Тогда
					    С=1;
				    КонецЕсли;
				КонецЦикла;
				Если С=0 Тогда 
					Стр=Объект.Тара.Добавить();
					Стр.Контейнер=ТТ;
				КонецЕсли;
			КонецЕсли;
			Объект.КолТары=Объект.Тара.Количество();
		ИначеЕсли Лев(Объект.ШК,3)="SOT" Или Лев(Объект.ШК,3)="sot" Или Лев(Объект.ШК,3)="ЫЩЕ"  Или Лев(Объект.ШК,3)="ыще"  тогда 
			
		Иначе 
		КонецЕсли; 
	КонецЕсли;
	Объект.ШК = "";
	ТекущийЭлемент=Элементы.ШК;
	
КонецПроцедуры
