&НаСервере
Процедура СформироватьОтчетНаСервере() экспорт
	//ОбъектОтчет = РеквизитФормыВЗначение(«Отчет»);
	//НаборЗаписей = РегистрыСведений.Логи.СоздатьНаборЗаписей();

	//НоваяЗапись = НаборЗаписей.Добавить();
	//НоваяЗапись.Кто = "Формирование отчета";
	//НоваяЗапись.Что = "Запуск";
	//НоваяЗапись.КакТак = "Нормально";
	//НоваяЗапись.Период=ТекущаяДата();
	//НаборЗаписей.Записать();

	ОСКД = Отчеты.ЗонаОтгрузки12.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	НастройкиОСКД = ОСКД.НастройкиПоУмолчанию; 
	//НастройкиОСКД = КомпоновщикНастроек.ПолучитьНастройкиОСКД();
	ПараметрыДанныхОСКД = НастройкиОСКД.ПараметрыДанных.Элементы;
	ЭлементПериод = ПараметрыДанныхОСКД.Найти("Период");
	ЭлементПериод.Использование = Истина;
	ЭлементПериод.Значение = ТекущаяДата();
	ЭлементТекДата = ПараметрыДанныхОСКД.Найти("ТекДата");
	ЭлементТекДата.Использование = Истина;
	ЭлементТекДата.Значение = ТекущаяДата();
	КомпоновщикМакетаОСКД = Новый КомпоновщикМакетаКомпоновкиДанных;
	//Макет = КомпоновщикМакетаОСКД.Выполнить(ОСКД, КомпоновщикНастроекДанных.ПолучитьНастройкиОСКД());
	Макет = КомпоновщикМакетаОСКД.Выполнить(ОСКД, НастройкиОСКД);
	ПроцессорКомпоновкиОСКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиОСКД.Инициализировать(Макет);
	ТаблДок=Новый ТабличныйДокумент;
	ПроцессорВыводаОСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаОСКД.УстановитьДокумент(ТаблДок);
	ПроцессорВыводаОСКД.Вывести(ПроцессорКомпоновкиОСКД);
	ТаблДок.Записать("c:\Товар на отгрузке_"+День(ТекущаяДата())+"-"+Месяц(ТекущаяДата())+"-"+Год(ТекущаяДата())+".xls","xls");
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	//Профиль.АдресСервераSMTP = "smtp.yandex.ru"; 
	//Профиль.ПортSMTP = 587;
	//Профиль.Пользователь = "zeykin@yandex.ru";
	//Профиль.Пароль = "alex4132";
	//Профиль.АутентификацияSMTP     = СпособSMTPАутентификации.Login;
	//Профиль.ПарольSMTP           = "alex4132";
	//Профиль.ПользовательSMTP     = "zeykin@yandex.ru"; 
	
	Профиль.АдресСервераSMTP = "smtp.mail.ru";
	//Профиль.АдресСервераPOP3 = "pop.mail.ru";
	//Профиль.ПортPOP3 = 995;
	Профиль.ПортSMTP = 465;
	Профиль.Пользователь = "asklepiy.nfs@mail.ru";
	Профиль.Пароль = "Tel3214570";
	Профиль.ПользовательSMTP = "asklepiy.nfs@mail.ru";
	Профиль.ПарольSMTP = "Tel3214570";
	Профиль.ИспользоватьSSLSMTP = Истина;   
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;

	
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Текст = Письмо.Тексты.Добавить("Добрый день!!! Это письмо выслано автоматически.Товар на отгрузке на "+ ТекущаяДата());
	Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	Письмо.Тема = "Test";
   Письмо.Отправитель = "asklepiy.nfs@mail.ru";
   Письмо.ИмяОтправителя = "asklepiy.nfs@mail.ru";
   Письмо.Получатели.Добавить("zeykin@yandex.ru");
   Письмо.Получатели.Добавить("ruslan_g@asklepiy.uz");
   Письмо.Получатели.Добавить("Umid@asklepiy.uz");
   Письмо.Получатели.Добавить("nataliya_k@asklepiy.uz");
   Письмо.Получатели.Добавить("Dfs@asklepiy.uz");
   Письмо.Получатели.Добавить("anna_k@asklepiy.uz");
   Письмо.Получатели.Добавить("Dfs@nfs.uz");
   Письмо.Получатели.Добавить("dfsmanager1@nfs.uz");
   Письмо.Получатели.Добавить("Asalik@asklepiy.uz");
   Письмо.Получатели.Добавить("ask_sklad@asklepiy.uz");
   Письмо.Получатели.Добавить("mahamir555@gmail.com");
   Письмо.Вложения.Добавить("c:\Товар на отгрузке_"+День(ТекущаяДата())+"-"+Месяц(ТекущаяДата())+"-"+Год(ТекущаяДата())+".xls");
   Почта = Новый ИнтернетПочта;     
   Попытка
	//НоваяЗапись = НаборЗаписей.Добавить();
	//НоваяЗапись.Кто = "Формирование отчета";
	//НоваяЗапись.Что = "Почта";
	//НоваяЗапись.КакТак = "Подключение";	
	//НоваяЗапись.Период=ТекущаяДата();
	
	//НаборЗаписей.Записать();
      Почта.Подключиться(Профиль);
      Сообщить("Подключено");
	  //НоваяЗапись = НаборЗаписей.Добавить();
	  //НоваяЗапись.Кто = "Формирование отчета";
	  //НоваяЗапись.Что = "Почта";
	  //НоваяЗапись.КакТак = "Успешно";		
	  //НоваяЗапись.Период=ТекущаяДата();

	//НаборЗаписей.Записать();
   Исключение
	// НоваяЗапись = НаборЗаписей.Добавить();
	//НоваяЗапись.Кто = "Формирование отчета";
	//НоваяЗапись.Что = "Почта";
	//НоваяЗапись.КакТак = "Не шмагла";	
	//НоваяЗапись.Период=ТекущаяДата();
	//
	//НаборЗаписей.Записать();
  	Сообщить("Не удалось подключиться к серверу");
   	Сообщить(ОписаниеОшибки());
   КонецПопытки;
   Попытка
	//НоваяЗапись = НаборЗаписей.Добавить();
	//НоваяЗапись.Кто = "Формирование отчета";
	//НоваяЗапись.Что = "Письмо";
	//НоваяЗапись.КакТак = "Отправка";	
	//НоваяЗапись.Период=ТекущаяДата();
	//
	//НаборЗаписей.Записать();
      Почта.Послать(Письмо);
      Сообщить("Письмо отправлено");
	//НоваяЗапись = НаборЗаписей.Добавить();
	//НоваяЗапись.Кто = "Формирование отчета";
	//НоваяЗапись.Что = "Письмо";
	//НоваяЗапись.КакТак = "Успешно";		
	//НоваяЗапись.Период=ТекущаяДата();

	//НаборЗаписей.Записать();
   Исключение

	//НоваяЗапись = НаборЗаписей.Добавить();
	//НоваяЗапись.Кто = "Формирование отчета";
	//НоваяЗапись.Что = "Письмо";
	//НоваяЗапись.КакТак = "Не шмагла";	
	//НоваяЗапись.Период=ТекущаяДата();
	//
	//НаборЗаписей.Записать();
  	Сообщить("Не удалось отправить письмо");
   	Сообщить(ОписаниеОшибки());
   КонецПопытки;
    
   Почта.Отключиться();
   Сообщить("Соединение завершено");	
КонецПроцедуры 
