
&НаКлиенте
Процедура СписокДокВПутевыхЛистахВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		ОткрытьЗначение(Элементы.СписокДокВПутевыхЛистах.ТекущиеДанные.ПутевойЛист);
КонецПроцедуры

&НаКлиенте
Процедура СписокДокУВодителяВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//ОткрытьЗначение(Элементы.СписокДокУВодителя.ТекущиеДанные.ДокументПрихода);

КонецПроцедуры

&НаКлиенте
Процедура СписокДокПогрузкаВАвтоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элементы.СписокДокПогрузкаВАвто.ТекущиеДанные.ДокументПрихода);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьПутевыеЛисты(Команда)
	
Если Вопрос("Удалить выбранные путевые листы?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
	Возврат;	
КонецЕсли;

	
	масИД=Элементы.СписокДокВПутевыхЛистах.ВыделенныеСтроки;
	Если масИД.Количество()=0 Тогда
		Сообщить("Ничего не выбрано.");
		Возврат;
	КонецЕсли;
	
	масДок=Новый Массив;
	
	Для Каждого эл_масИД Из масИД Цикл
		//Сообщить(Элементы.СписокДокВПутевыхЛистах.ДанныеСтроки(эл_масИД).ПутевойЛист);
	масДок.Добавить(Элементы.СписокДокВПутевыхЛистах.ДанныеСтроки(эл_масИД).ПутевойЛист);	
	КонецЦикла;
	 УдалитьПутевыеЛистыСервер(масДок);
	 
	 Элементы.СписокДокВПутевыхЛистах.Обновить();
КонецПроцедуры

&НаСервере
Процедура  УдалитьПутевыеЛистыСервер(масДок)
	
	ТЗдок=Новый ТаблицаЗначений;
	ТЗдок.Колонки.Добавить("ДокСсылка");
	Для Каждого эл_масДок Из масДок Цикл
		новСтрока=ТЗдок.Добавить();
		новСтрока.ДокСсылка=эл_масДок;
	КонецЦикла;
	
	ТЗдок.Свернуть("ДокСсылка");
	Для Каждого стр_ТЗдок Из ТЗдок Цикл
		Сообщить(Строка(стр_ТЗдок.ДокСсылка)+"-Удален");
		стр_ТЗдок.ДокСсылка.ПолучитьОбъект().Удалить();
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьВыделенныхБЯС(Команда)
	масСтрок=Элементы.СписокДокВПутевыхЛистах.ВыделенныеСтроки;
	масДок=Новый Массив;
	Для Каждого эл_масСтрок Из масСтрок Цикл
		докБЯС=Элементы.СписокДокВПутевыхЛистах.ДанныеСтроки(эл_масСтрок).ДокументПрихода;
		Сообщить(докБЯС);
		масДок.Добавить(докБЯС);		
		
	КонецЦикла;
	//ТД=Новый ТабличныйДокумент;
	ТД=ПечатьВыделенныхБЯССЕРВЕР(масДок);
	  	
	ТД.Показать();
КонецПроцедуры
 &НаСервере
 Функция ПечатьВыделенныхБЯССЕРВЕР(масДок) 
	 
	 ТД=Новый ТабличныйДокумент;
	  ТД_БЯС=Новый ТабличныйДокумент;

     Для Каждого эл_масДок Из масДок Цикл
		//Сообщить(докБЯС);
        Документы.БольшаяЯчеистаяСборка.Печать(ТД_БЯС,эл_масДок);
		ТД.Вывести(ТД_БЯС);
	КонецЦикла;

	 	
	Возврат ТД;
	 
 КонецФункции


&НаКлиенте
 Процедура СоздатьПриемТовараВодителем(Команда)
	 Если Вопрос("Создать документы ПриемТовараВодителем?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		 Возврат;	
	 КонецЕсли;
	 
	 масВыбранныхСтрок=Элементы.СписокДокВПутевыхЛистах.ВыделенныеСтроки;
	 масСтрок=Новый Массив;
	 Для Каждого эл_масВыбранныхСтрок Из масВыбранныхСтрок Цикл
		 масСтрок.Добавить(Элементы.СписокДокВПутевыхЛистах.ДанныеСтроки(эл_масВыбранныхСтрок));	// 
	 КонецЦикла;
	 
	 СоздатьПриемТовараВодителемСервер(масСтрок);
	 Элементы.СписокДокВПутевыхЛистах.Обновить();
	 
		
 КонецПроцедуры
 
 &НаСервере
 Процедура СоздатьПриемТовараВодителемСервер(масСтрок)
	 
	Для Каждого эл_масСтрок Из масСтрок Цикл
	новыйДок=Документы.ПриемТовараВодителем.СоздатьДокумент();
	новыйДок.Дата=ТекущаяДата();
	новыйДок.Водитель=эл_масСтрок.ПутевойЛист.Водитель;
	новыйДок.Подразделение=Справочники.Подразделения.НайтиПоНаименованию(СокрЛП(эл_масСтрок.ДокументПрихода.Организация));;
	новыйДок.ДокБЯС=эл_масСтрок.ДокументПрихода;
	новыйДок.НомераСФ= эл_масСтрок.ДокументПрихода.НомераСФ;
	новыйДок.КоличествоКоробок=эл_масСтрок.ДокументПрихода.Коробки;
	новыйДок.КоличествоКоробокПриПроверке=эл_масСтрок.ДокументПрихода.Коробки;
	новыйДок.ОбщийВес=эл_масСтрок.ДокументПрихода.ОбщийВес;
	новыйДок.ОбщийОбъем=эл_масСтрок.ДокументПрихода.ОбщийОбъем;
	новыйДок.ПутевойЛист=эл_масСтрок.ПутевойЛист;
	//Заполняем ТЧ МестаОтгрузки
	Для Каждого эл_ТЧместоОтгрузки Из эл_масСтрок.ДокументПрихода.МестаОтгрузки Цикл
		новМестоОтгрузки=новыйДок.МестаОтгрузки.Добавить();
		новМестоОтгрузки.МестоОтгрузки= эл_ТЧместоОтгрузки.МестоОтгрузки;
		новМестоОтгрузки.ДокументПрихода=эл_масСтрок.ДокументПрихода;
		новМестоОтгрузки.КоличествоКоробок =эл_ТЧместоОтгрузки.КоличествоКоробок;
		новМестоОтгрузки.Контрагент   =эл_масСтрок.ДокументПрихода.Получатель;
		новМестоОтгрузки.ПутевойЛист=эл_масСтрок.ПутевойЛист;
	КонецЦикла;
	//Заполняем ТЧ ДокументыРасхода
	Для Каждого эл_ТЧДокументыРасхода Из эл_масСтрок.ДокументПрихода.ДокументыРасхода Цикл
		новДокРасхода=новыйДок.ДокументыРасхода.Добавить();
		новДокРасхода.Док= эл_ТЧДокументыРасхода.Док;
		новДокРасхода.СчетФ =эл_ТЧДокументыРасхода.СчетФ;
		новДокРасхода.ШК= эл_ТЧДокументыРасхода.ШК;
		новДокРасхода.ДокНомер= эл_ТЧДокументыРасхода.ДокНомер;
		новДокРасхода.Проверен= Истина;
		
	КонецЦикла;
	
	новыйДок.Записать(РежимЗаписиДокумента.Проведение);
     КонецЦикла;

 КонецПроцедуры

&НаКлиенте
 Процедура СоздатьПогрузкаВАвто(Команда)
	  Если Вопрос("Создать документы ПогрузкаТоваровВАвтомобиль?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		 Возврат;	
	 КонецЕсли;
	 
	 Если Не ЗначениеЗаполнено(ЭтаФорма.РаботникОхраны) Тогда
		 Сообщить("Не выбран работник охраны.");
		 Возврат;	 
	 КонецЕсли;
	 
		 
	 масВыбранныхСтрок=Элементы.СписокДокУВодителяРЕГИСТР.ВыделенныеСтроки;
	 масСтрок=Новый Массив;
	 Для Каждого эл_масВыбранныхСтрок Из масВыбранныхСтрок Цикл
		 масСтрок.Добавить(Элементы.СписокДокУВодителяРЕГИСТР.ДанныеСтроки(эл_масВыбранныхСтрок));	// 
	 КонецЦикла;
	 
	 СоздатьПогрузкаВАвтоСЕРВЕР(масСтрок);
	 Элементы.СписокДокУВодителяРЕГИСТР.Обновить();

 КонецПроцедуры
 
 &Насервере
 Процедура  СоздатьПогрузкаВАвтоСЕРВЕР(масСтрок)
	Для Каждого эл_масСтрок Из масСтрок Цикл
		
		докПриемТовараВодителем=эл_масСтрок.ДокументПрихода;
		
		новыйДок=Документы.ПогрузкаТоваровВАвтомобиль.СоздатьДокумент();
		новыйДок.Дата=ТекущаяДата();
		новыйДок.Водитель=докПриемТовараВодителем.Водитель;
		новыйДок.КоличествоКоробок=докПриемТовараВодителем.КоличествоКоробок;
		новыйДок.ОбщийВес=докПриемТовараВодителем.ОбщийВес;
		новыйДок.ОбщийОбъем=докПриемТовараВодителем.ОбщийОбъем;
		новыйДок.Подразделение=докПриемТовараВодителем.Подразделение;
		новыйДок.РаботникОхраны=ЭтаФорма.РаботникОхраны;
		
		новыйДок.Контрагент=докПриемТовараВодителем.Контрагент;
		
		новыйДок.ПутевойЛист=докПриемТовараВодителем.ПутевойЛист;
		новыйДок.ДокументОснование=докПриемТовараВодителем;
		
		новыйДок.ДокументыРасхода.Загрузить(докПриемТовараВодителем.ДокументыРасхода.Выгрузить());
		новыйДок.МестаОтгрузки.Загрузить(докПриемТовараВодителем.МестаОтгрузки.Выгрузить());
		
		новыйДок.Записать(РежимЗаписиДокумента.Проведение);

		Сообщить("Создан документ-"+НовыйДок);
		
	КонецЦикла;
	 
 КонецПроцедуры
 