
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// ЧУЖИЕ АВТО
	Если ЗначениеЗаполнено(Жетон) Тогда
	// регистр АвтоНаТерритории Приход
	Движения.АвтоНаТерритории.Записывать = Истина;
	Движение = Движения.АвтоНаТерритории.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = ДатаВремяВъезда;
	Движение.АвтоЖетон = Жетон;
	Движение.ДокументВъездаВыезда = Ссылка;
	Движение.Значение = 1;

	// регистр АвтоНаТерритории Расход
	Если ЗначениеЗаполнено(ДатаВремяВыезда) Тогда
		Движения.АвтоНаТерритории.Записывать = Истина;
		Движение = Движения.АвтоНаТерритории.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ДатаВремяВыезда;
		Движение.АвтоЖетон = Жетон;
		Движение.ДокументВъездаВыезда = Ссылка;
		Движение.Значение = 1;
	КонецЕсли;
	
	
	
	КонецЕсли;

	
	 //АВТО КОМПАНИИ
	 Если ЗначениеЗаполнено(Водитель) Тогда
	// регистр АвтоКомпанииНаТерритории Приход
	Движения.АвтоКомпанииНаТерритории.Записывать = Истина;
	Движение = Движения.АвтоКомпанииНаТерритории.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = ДатаВремяВъезда;
	Движение.Водитель = Водитель;
	Движение.ДокументВъездаВыезда = Ссылка;
	Движение.Значение = 1;

	// регистр АвтоКомпанииНаТерритории Расход
	Если ЗначениеЗаполнено(ДатаВремяВыезда) Тогда
		Движения.АвтоКомпанииНаТерритории.Записывать = Истина;
		Движение = Движения.АвтоКомпанииНаТерритории.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ДатаВремяВыезда;
		Движение.Водитель = Водитель;
		Движение.ДокументВъездаВыезда = Ссылка;
		Движение.Значение = 1;
	КонецЕсли;
	
	
	
	КонецЕсли;


	
	
	
КонецПроцедуры
