
&НаКлиенте
Процедура ПослатьСообщениеПользователю() Экспорт
	
	Попытка	
		
		
		РезультатПроверки=Неопределено; //ТТТТТ
		омСообщенияПользователям.ПослатьСообщениеПользователюСЕРВЕР(РезультатПроверки,Ложь);
		
		Если РезультатПроверки<>Неопределено Тогда
			Для Каждого эл_РезультатПроверки Из РезультатПроверки Цикл
				ТекстСообщения=эл_РезультатПроверки.ТекстСообщения;
				Если   эл_РезультатПроверки.ВидСообщения="Предупреждение" Тогда
					ЗаголовокСообщения="Сообщение №"+Строка(эл_РезультатПроверки.КоличествоПосланныхСообщений)+
					" от - "+Строка(эл_РезультатПроверки.ИсточникСообщения+ " ["+ТекущаяДата()+"]");
					Предупреждение(ТекстСообщения,0,ЗаголовокСообщения);			
				ИначеЕсли эл_РезультатПроверки.ВидСообщения="Сообщение" Тогда
					Сообщить("Сообщение №"+Строка(эл_РезультатПроверки.КоличествоПосланныхСообщений)+
					Символы.ПС+"От: "+Строка(эл_РезультатПроверки.ИсточникСообщения)+
					Символы.ПС+"["+ТекущаяДата()+"]"+
					Символы.ПС+ТекстСообщения);
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	Исключение
		
		Комментарий=Строка(ОписаниеОшибки());
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			ЗаписьЖурналаРегистрации("ОШИБКА-ОТПРАВКА СООБЩЕНИЙ", 
			УровеньЖурналаРегистрации.Информация, , ,
			Комментарий);
		#КонецЕсли
		
	КонецПопытки;	
	
КонецПроцедуры

