
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ДвижениеТарыПоШК.Записывать = Истина;
	Для каждого Стр Из Тара Цикл
		Движение = Движения.ДвижениеТарыПоШК.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = НачалоДня(Дата);
		Если ЗначениеЗаполнено(Водитель) тогда
			Движение.УКого = Водитель;
		Иначе
			Движение.УКого = "1. Склад";
		КонецЕсли;	
		Движение.Тара = Стр.Контейнер;
		Если ЗначениеЗаполнено(Клиент) тогда
			Движение.Клиент = Клиент;
			Если ЗначениеЗаполнено(Водитель) тогда
				Движение.УКого = Водитель;
			Иначе
				Движение.УКого = "3. В Аптеке";
			КонецЕсли;	
				
		Иначе
			Движение.Клиент = "Склад";
		КонецЕсли;	
		Движение.Кол = 1;
	КонецЦикла;
КонецПроцедуры
