
&НаСервере
Процедура ПереносНаСервере()
	ЕстьНомер=Истина;
	СтрНом=0;
	Пока ЕстьНомер Цикл
		СтрНом=СтрНом+1;
		Если  ТД.Область(СтрНом,1).Текст<>"" тогда
			Если  ТД.Область(СтрНом,9).Текст<>"" и ТД.Область(СтрНом,10).Текст<>"" тогда
			СтрТЗ=ТЗ.Добавить();
			СтрТЗ.Код= ТД.Область(СтрНом,1).Текст ;
			СтрТЗ.Название= ТД.Область(СтрНом,2).Текст ;
			СтрТЗ.Город= ТД.Область(СтрНом,3).Текст ;
			СтрТЗ.Район= ТД.Область(СтрНом,4).Текст ;
			СтрТЗ.Территория= ТД.Область(СтрНом,5).Текст ;
			СтрТЗ.Адрес= ТД.Область(СтрНом,6).Текст ;
			СтрТЗ.Ориентир= ТД.Область(СтрНом,7).Текст ;
			СтрТЗ.Группа= ТД.Область(СтрНом,8).Текст ;
			СтрТЗ.ИНН= ТД.Область(СтрНом,9).Текст ;
			СтрТЗ.GPS= ТД.Область(СтрНом,10).Текст ;
			Мас=СтрРазделить(СтрТЗ.GPS,",");
			Для каждого Коры Из Мас Цикл
			    С=Число(Коры);
				Если С>50 Тогда
					СтрТЗ.Х=С;
				Иначе
					СтрТЗ.У=С;
				КонецЕсли;	
			КонецЦикла; 
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Контрагенты.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.ИНН = &ИНН";
			
			Запрос.УстановитьПараметр("ИНН",СтрТЗ.ИНН );
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл
			    Клиент=Выборка.Ссылка.ПолучитьОбъект();
				Клиент.КорX=СтрТЗ.Х;
				Клиент.КорY=СтрТЗ.У;
				Клиент.Записать();
			КонецЦикла;
			
			КонецЕсли;
		Иначе
			ЕстьНомер=Ложь
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Перенос(Команда)
	ПереносНаСервере();
КонецПроцедуры
