
&НаКлиенте
Процедура ПечатьШКСчетФактур(Команда)
	//масСтрок=Элементы.Данные.ВыделенныеСтроки;
	масДок=Новый Массив;
	Для Каждого эл_ТЧДанные Из Объект.Данные Цикл
		//докБЯС=Элементы.Данные.ДанныеСтроки(эл_масСтрок).ДокументПрихода;
		докБЯС=эл_ТЧДанные.ДокументПрихода;

		Сообщить(докБЯС);
		масДок.Добавить(докБЯС);		
		
	КонецЦикла;
	//ТД=Новый ТабличныйДокумент;
	ТД=ПечатьВыделенныхБЯССЕРВЕР(масДок);
	  	
	ТД.Показать();

КонецПроцедуры


 &НаСервере
 Функция ПечатьВыделенныхБЯССЕРВЕР(масДок) 
	 
	 ТД=Новый ТабличныйДокумент;
	  ТД_БЯС=Новый ТабличныйДокумент;

    Для Каждого эл_масДок Из масДок Цикл
		//Сообщить(докБЯС);
        Документы.БольшаяЯчеистаяСборка.Печать(ТД_БЯС,эл_масДок);
		ТД.Вывести(ТД_БЯС);
	КонецЦикла;

	 	
	Возврат ТД;
	 
 КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	 ВозвратныеСФ.Параметры.УстановитьЗначениеПараметра("Водитель",Объект.Водитель);
 	 ВозвратныеСФ.Параметры.УстановитьЗначениеПараметра("Дата1",НачалоДня(Объект.Дата));
	 ВозвратныеСФ.Параметры.УстановитьЗначениеПараметра("Дата2",КонецДня(Объект.Дата));
КонецПроцедуры

&НаКлиенте
 Процедура ВозвратныеСФВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	 ОткрытьЗначение(Элементы.ВозвратныеСФ.ТекущиеДанные.Ссылка);
 КонецПроцедуры
