
&НаКлиенте
Процедура СписокБЯСДляПутевыхЛистовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//Сообщить(Элементы.СписокБЯСДляПутевыхЛистов.ТекущиеДанные.ДокументПрихода);
	Если РедактироватьПутевыеЛисты Тогда
	ДобавитьСФвПутевойЛист(Null);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПутевойЛист(Команда)
	Если НЕ ЗначениеЗаполнено(Водитель) Тогда
		Сообщить("Выберите водителя.");
		Возврат;	
	КонецЕсли;
	СоздатьПутевойЛистСЕРВЕР();
	ОбновитьСписки();
КонецПроцедуры

&НаСервере
Процедура СоздатьПутевойЛистСЕРВЕР()
	//Ищем Путевой Лист Для Водителя на Сегодня
	поискПутевойЛист=модСерверПолныеПрава.НайтиПутевойЛист_2(Водитель,НачалоДня(ТекущаяДата()));
	Если поискПутевойЛист<>Неопределено Тогда
		
		Сообщить("Путевой лист для водителя "+Водитель + " уже есть.");
		Возврат;	
	КонецЕсли;
	
	//Создаем пустой Путевой Лист
	новыйДок=Документы.ПутевойЛист_2.СоздатьДокумент();
	новыйДок.Дата=НачалоДня(ТекущаяДата());
	новыйДок.Водитель=Водитель;
	новыйДок.Записать(РежимЗаписиДокумента.Запись);
	Сообщить("Создан Путевой Лист для "+Водитель);
	 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписки()
	Элементы.СписокБЯСДляПутевыхЛистов.Обновить();
	Элементы.ТекущиеПутевыеЛисты.Обновить();
	Элементы.ТекущиеПутевыеЛистыДанные.Обновить();
	Элементы.ПутевыеЛисты.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСФвПутевойЛист(Команда)
	
	ДокПЛ=Элементы.ТекущиеПутевыеЛисты.ТекущиеДанные.Ссылка;
	ДокБЯС=Элементы.СписокБЯСДляПутевыхЛистов.ТекущиеДанные.ДокументПрихода;
	
	ДобавитьСФвПутевойЛистСЕРВЕР(ДокПЛ,ДокБЯС);
    ОбновитьСписки();
	//ОбновитьТЧ
	ТекСТР=Элементы.ТекущиеПутевыеЛисты.ТекущаяСтрока;
	Элементы.ТекущиеПутевыеЛисты.ТекущаяСтрока=-1;
	Элементы.ТекущиеПутевыеЛисты.ТекущаяСтрока=ТекСТР;
	
КонецПроцедуры

&НаСервере
Процедура  ДобавитьСФвПутевойЛистСЕРВЕР(ДокПЛссылка,ДокБЯСссылка)
	
	ДокПЛ=ДокПЛссылка.ПолучитьОбъект();
	//Проверка на задвоенность
	поискБЯС=ДокПЛ.Данные.Найти(ДокБЯСссылка,"ДокументПрихода");
	Если  поискБЯС<>Неопределено Тогда
		Сообщить("Эта СчетФ уже в путевом листе.");
		Возврат;
	КонецЕсли;
	//Добавляем СФ
	новаяСтрока=ДокПЛ.Данные.Добавить();
	новаяСтрока.ДокументПрихода=ДокБЯСссылка;
	ДокПЛ.Записать(РежимЗаписиДокумента.Проведение);
		
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСФизПутевогоЛиста(Команда)
	
	Если РедактироватьПутевыеЛисты Тогда
	ДокПЛ=Элементы.ТекущиеПутевыеЛисты.ТекущиеДанные.Ссылка;
	ДокБЯС=Элементы.ТекущиеПутевыеЛистыДанные.ТекущиеДанные.ДокументПрихода;
	УдалитьСФизПутевогоЛистаСЕРВЕР(ДокПЛ,ДокБЯС);
    ОбновитьСписки();
Иначе
	Сообщить("Редатирование НЕ разрешено.");
	КонецЕсли;
КонецПроцедуры

  &НаСервере
Процедура  УдалитьСФизПутевогоЛистаСЕРВЕР(ДокПЛссылка,ДокБЯСссылка)
	
	ДокПЛ=ДокПЛссылка.ПолучитьОбъект();
	//Проверка на задвоенность
	поискБЯС=ДокПЛ.Данные.Найти(ДокБЯСссылка,"ДокументПрихода");
	Если  поискБЯС=Неопределено Тогда
		Сообщить("Этой СчетФ НЕТ в путевом листе.");
		Возврат;
	КонецЕсли;
	//Удаляем СФ
	ДокПЛ.Данные.Удалить(поискБЯС);
	ДокПЛ.Записать(РежимЗаписиДокумента.Проведение);
    
	//Удаляем ПЛ Из БЯС
	ДокБЯС=ДокБЯСссылка.ПолучитьОбъект();
	ДокБЯС.ПутевойЛист="";
	ДокБЯС.Записать(РежимЗаписиДокумента.Запись);
			
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСписки();

КонецПроцедуры

&НаКлиенте
Процедура ТекущиеПутевыеЛистыПриАктивизацииСтроки(Элемент)
	Попытка
		//СС=Элементы.ТекущиеПутевыеЛисты.ТекущиеДанные.Ссылка;
		//ТекущиеПутевыеЛистыДанные.Параметры.УстановитьЗначениеПараметра("Ссылка",СС );
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		//ТекущиеПутевыеЛистыДанные.Параметры.УстановитьЗначениеПараметра("Ссылка","" );
КонецПроцедуры


