
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	// Вставить содержимое обработчика.
	// ПараметрыФормы = Новый Структура("", );
	// ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	 УдалениеАвтоРезервирования();
КонецПроцедуры 

&НаСервере
Процедура УдалениеАвтоРезервирования()
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АвторезервированиеВПодборе.IDВладельца,
	               |	АвторезервированиеВПодборе.Подразделение,
	               |	АвторезервированиеВПодборе.Номенклатура,
	               |	АвторезервированиеВПодборе.СерияНоменклатуры,
	               |	АвторезервированиеВПодборе.ДокументПоступления,
	               |	АвторезервированиеВПодборе.Количество,
	               |	АвторезервированиеВПодборе.Пользователь
	               |ИЗ
	               |	РегистрСведений.АвторезервированиеВПодборе КАК АвторезервированиеВПодборе
	               |ГДЕ
	               |	АвторезервированиеВПодборе.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
	Запись = РегистрыСведений.АвторезервированиеВПодборе.СоздатьМенеджерЗаписи();
	Запись.IDВладельца = Выборка.IDВладельца;
	Запись.Подразделение = Выборка.Подразделение;
	Запись.Номенклатура = Выборка.Номенклатура;
	Запись.СерияНоменклатуры = Выборка.СерияНоменклатуры;
	Запись.ДокументПоступления = Выборка.ДокументПоступления;
	
	Запись.Удалить();
    КонецЦикла;
КонецПроцедуры
