

&НаКлиенте
Процедура ШКСчетФактураИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Сообщить("Введите Штрих-Код");
	Иначе ЗаполнениеСтрокиПоШК(Текст);
		Сообщить("Ссылка по ШК не найдена!"); //для инф
		Возврат;
	КонецЕсли;
          
КонецПроцедуры


Процедура ЗаполнениеСтрокиПоШК(ШК)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШК", ШК);
	Запрос.Текст = "ВЫБРАТЬ
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.ШК,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.ДатаДокумента КАК ДатаДок,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Сумма КАК СуммаОтгрузки,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка.Организация КАК Организация,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка.ОбщийОбъем КАК Обьем,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка.ОбщийВес КАК Вес,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка.Получатель.ПолноеНаименование КАК Получатель,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка.Направление.Наименование КАК Город,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка.НомераСФ КАК НомерСчетФатуры,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка
	               |ИЗ
	               |	Документ.БольшаяЯчеистаяСборка.ДокументыРасхода КАК БольшаяЯчеистаяСборкаДокументыРасхода
	               |ГДЕ
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.ШК = &ШК
	               |	И БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка.Проведен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка.Направление.Ссылка";
	Если Не Запрос.Выполнить().Пустой() Тогда 
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект.Направление.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
			НоваяСтрока.СуммаОтгрузки=  Выборка.Ссылка.ДокументыРасхода.итог("Сумма");
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

	
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	
	Если Источник = "СканерШтрихкода" И Событие = "Barcode" И ЗначениеЗаполнено(Данные) Тогда
		
		ЗаполнениеСтрокиПоШК(Лев(Данные, 12)) ;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоГорорду(Команда)
	Объект.Направление.Сортировать("Город Возр"); 
КонецПроцедуры



