
&НаКлиенте
Процедура ВыгрузитьСчетФактурыВФайл(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры),
	"Выполнить выгрузку счет-фактур в файл?!", РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	Состояние("Происходит выгрузка счет-фактур");
	
	омРегламентныеЗаданияСЕРВЕР.ВыгрузкаСчетФактурВФайл(ТекущаяДата());
	
	СообщениеПользователю = Новый СообщениеПользователю();
	СообщениеПользователю.Текст = "Выгрузка завершена!";
	СообщениеПользователю.Сообщить();
    
КонецПроцедуры
