&НаКлиенте
Процедура ПечатьШК(Команда)
	Если Не ЗначениеЗаполнено(Объект.Штрихкод) Тогда
		Сообщить("Поле ШК не заполнено.");
		Возврат;	
	КонецЕсли;
	
	ТабличныйДокумент = ПечатнаяФорма();
	
	Если ТабличныйДокумент <> Неопределено Тогда
		ТабличныйДокумент.Показать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция  ПечатнаяФорма() 
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	
	//Макет = Обработки.ПроизвольнаяПечатьШК.ПолучитьМакет("Макет");
	Макет=Справочники.ФизическиеЛица.ПолучитьМакет("Макет");
	Область1 = Макет.ПолучитьОбласть("Шапка");
	Область1.Параметры.ПроизвольныйТекст = Объект.Наименование;
	КартинкаШтрихкода = ОбщийМодуль_Каштан.ПолучитьКартинкуШтрихкода(Объект.Штрихкод, 100, 90);
	Рисунок = Область1.Область("ШК1");
	Рисунок.Картинка = КартинкаШтрихкода;
	ТабличныйДокумент.Вывести(Область1);
	
	Возврат ТабличныйДокумент;
	
КонецФункции	

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если Источник = "СканерШтрихкода" и Событие = "Barcode" и Значениезаполнено(Данные) тогда 	
		ЭтаФорма.ТекущийЭлемент=Элементы.Штрихкод;
		Объект.Штрихкод = Данные;
		ЭтаФорма.Модифицированность=Истина;
	КонецЕсли;

КонецПроцедуры


