
Процедура ДокументыПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
Док=Источник;
	
	докЛогин1С="Неопределен";
	докКомпьютер="Неопределен";
	
	Попытка
		докЛогин1С=ИмяПользователя();	
	Исключение
		докЛогин1С="Неопределен";	
	КонецПопытки;
	
	Попытка
		докКомпьютер=ПараметрыСеанса.ПК;	
	Исключение
		докКомпьютер="Неопределен";
	КонецПопытки;
	
		
	СЛК="[ЛОГИН-"+докЛогин1С+"][ПК-"+ докКомпьютер+"]";
	
	Попытка	
		
		Если НЕ ЗначениеЗаполнено(Док.Ссылка) Тогда
			Док.ДВСоздания=ДВС();
			Док.Создал=СЛК; 
			ТипЗаписи="Создание";
		Иначе
			Док.ДВИзменения=ДВС();
			Док.СИ=Док.СИ+1;
			Док.Изменил=СЛК; 
			ТипЗаписи="Изменение №"+Строка(Док.СИ);
		КонецЕсли;
		
	Исключение
		Комментарий=Строка(ОписаниеОшибки())+ "-"+Строка(Источник);
		ЗаписьЖурналаРегистрации("ДокументыПередЗаписьюОшибка", 
		УровеньЖурналаРегистрации.Информация, , ,
		Комментарий);
		Возврат;
	КонецПопытки;
	
	//Запись в ЖурналИзмененийДокументов
	Попытка
		Комментарий=Строка(Источник.Номер)+"-"+ Строка(Источник.Дата)+" "+Строка(Источник);
		модСерверПолныеПрава.ЗаписатьВЖурналИзмененийДокументов(ТипЗаписи,Источник,СЛК,Комментарий);
	Исключение
		Комментарий=Строка(ОписаниеОшибки())+ "-"+Строка(Источник);
		ЗаписьЖурналаРегистрации("ОШИБКА-ДокументыЖурналИзмененийДокументов", 
		УровеньЖурналаРегистрации.Информация, , ,
		Комментарий);

	КонецПопытки;


КонецПроцедуры

Процедура ДокументыВнешниеПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
		
Док=Источник;
	
	докЛогин1С="ЗагрузкаБЯС";
	докКомпьютер="Неопределен";
	
	Попытка
		докЛогин1С=ИмяПользователя();	
	Исключение
		докЛогин1С="ЗагрузкаБЯС";	
	КонецПопытки;
	
	Попытка
		докКомпьютер=ПараметрыСеанса.ПК;	
	Исключение
		докКомпьютер="Неопределен";
	КонецПопытки;
	
		
	СЛК="[ЛОГИН-"+докЛогин1С+"][ПК-"+ докКомпьютер+"]";
	
	Попытка	
		
		Если НЕ ЗначениеЗаполнено(Док.Ссылка) Тогда
			Док.ДВСоздания=ДВС();
			Док.Создал=СЛК; 
			ТипЗаписи="Создание";
		Иначе
			Док.ДВИзменения=ДВС();
			Док.СИ=Док.СИ+1;
			Док.Изменил=СЛК; 
			ТипЗаписи="Изменение №"+Строка(Док.СИ);
		КонецЕсли;
		
	Исключение
		Комментарий=Строка(ОписаниеОшибки())+ "-"+Строка(Источник);
		ЗаписьЖурналаРегистрации("ДокументыПередЗаписьюОшибка", 
		УровеньЖурналаРегистрации.Информация, , ,
		Комментарий);
		Возврат;
	КонецПопытки;
	
	//Запись в ЖурналИзмененийДокументов
	Попытка
		
		Комментарий=Строка(Источник.Номер)+"-"+ Строка(Источник.Дата)+" "+Строка(Источник);
		//Комментарий="Загрузка БЯС";
		
		модСерверПолныеПрава.ЗаписатьВЖурналИзмененийДокументов(ТипЗаписи,Источник.Ссылка,СЛК,Комментарий);
	Исключение
		Комментарий=Строка(ОписаниеОшибки())+ "-"+Строка(Источник);
		ЗаписьЖурналаРегистрации("ОШИБКА-ДокументыВнешниеЖурналИзмененийДокументов", 
		УровеньЖурналаРегистрации.Информация, , ,
		Комментарий);

	КонецПопытки;

КонецПроцедуры

Процедура ДокументыПередУдалениемПередУдалением(Источник, Отказ) Экспорт
	Док=Источник;
	
	докЛогин1С="Неопределен";
	докКомпьютер="Неопределен";
	
	Попытка
		докЛогин1С=ИмяПользователя();	
	Исключение
		докЛогин1С="Неопределен";	
	КонецПопытки;
	
	Попытка
		докКомпьютер=ПараметрыСеанса.ПК;	
	Исключение
		докКомпьютер="Неопределен";
	КонецПопытки;
	
		
	СЛК="[ЛОГИН-"+докЛогин1С+"][ПК-"+ докКомпьютер+"]";

	
	
	
	
	//************** Запрет Удаления Проведенных Документов *****************//
	//Если Константы.ЗапретитьУдалениеПроведенныхДокументов.Получить() Тогда
	//	Если Источник.Проведен Тогда
	//		Сообщить("Запрещено удаление проведенных документов.");
	//		Отказ=Истина;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	//************** Проверка на дату запрета изменений ********************
	//Если Источник.Дата<=Константы.ДатаЗапретаИзменений.Получить() Тогда
	//	Стр="Удаление невозможно.Документ в Запретном периоде. Дата запрета изменений-" +
	//	Формат(Константы.ДатаЗапретаИзменений.Получить(),"ДФ=dd.MM.yyyy");
	//	Сообщить(Стр);
	//	Отказ=Истина;
	//	Возврат;
	//КонецЕсли;
	
	//Запись в ЖурналИзмененийДокументов
	Попытка
		Комментарий=Строка(Источник.Номер)+"-"+ Строка(Источник.Дата)+" "+Строка(Источник);
		модСерверПолныеПрава.ЗаписатьВЖурналИзмененийДокументов("Удаление",Источник,СЛК,Комментарий);
	Исключение
	КонецПопытки;

КонецПроцедуры



