
//Евгений
&НаСервере
Функция НайденныйДок(ШК)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка КАК БЯС,
	|	БольшаяЯчеистаяСборкаДокументыРасхода.НомерСтроки,
	|	БольшаяЯчеистаяСборкаДокументыРасхода.Док,
	|	БольшаяЯчеистаяСборкаДокументыРасхода.СчетФ,
	|	БольшаяЯчеистаяСборкаДокументыРасхода.ШК,
	|	БольшаяЯчеистаяСборкаДокументыРасхода.ДокНомер,
	|	БольшаяЯчеистаяСборкаДокументыРасхода.Проверен,
	|	БольшаяЯчеистаяСборкаДокументыРасхода.Комментарий,
	|	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка.ПутевойЛист
	|ИЗ
	|	Документ.БольшаяЯчеистаяСборка.ДокументыРасхода КАК БольшаяЯчеистаяСборкаДокументыРасхода
	|ГДЕ
	|	БольшаяЯчеистаяСборкаДокументыРасхода.ШК = &ШК";	
	Запрос.УстановитьПараметр("ШК", ШК);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.БЯС;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
	
	
	
КонецФункции





Процедура НайтиДок()
	//Запрос =Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ТоварыНаСкладахОстатки.НомерМестаОтгрузки КАК НомерМеста,
	//			   |	ТоварыНаСкладахОстатки.ДокументПрихода КАК Документ,
	//			   |	ТоварыНаСкладахОстатки.Контрагент КАК Контрагент,
	//			   |	ТоварыНаСкладахОстатки.КоличествоКоробокОстаток КАК Количество,
	//			   |	ТоварыНаСкладахОстатки.ОбъемОстаток КАК Объем,
	//			   |	ТоварыНаСкладахОстатки.ВесОстаток КАК Вес
	//			   |ИЗ
	//			   |	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки";
	//Результат = Запрос.Выполнить();
	//СписокДокументов.Загрузить(Результат.Выгрузить());
КонецПроцедуры

//**********************************************************//

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если НЕ ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник = "СканерШтрихкода" И Событие = "Barcode" И ЗначениеЗаполнено(Данные) Тогда
		
		Если ЗначениеЗаполнено(СокрЛП(Данные)) Тогда
			//--- Сброс Формы
			//Сообщить(СокрЛП(Данные));
			Если (СокрЛП(Данные))="000000000000" Тогда
				Сброс(Null);
				ОчиститьСообщения();
				//Сообщить("Сброс");
				Возврат;
			КонецЕсли;
			
			Если (СокрЛП(Данные))="111111111111" Тогда
				//Сохранить запись
				 Сохранить(Null);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		//Если охрана не заполнена то Ищем Охранника
		Если Не ЗначениеЗаполнено(ШКОхрана) Тогда
			ШКОхрана = Данные;
			НайденныйОхранник = НайтиФизЛицоПоШк(ШКОхрана,"РаботникОхраны");
			Если Не ЗначениеЗаполнено(НайденныйОхранник) Тогда
				ОчиститьСообщения();
				Сообщить("Охранник не найден!!!");
				ШКОхрана = "";
				РаботникОхраны = "";
			Иначе 
				РаботникОхраны = НайденныйОхранник;
			КонецЕсли;
			Возврат;
		КонецЕсли;	
		
		//Если Охрана заполнена - Ищем Водителя		
		
		Если ЗначениеЗаполнено(ШКОхрана) Тогда
			ШКНовыйВодитель = Данные;
			НовыйВодитель = НайтиФизЛицоПоШк(ШКНовыйВодитель,"Водитель");
			
			//Проверка на нового водителя
			Если ЗначениеЗаполнено(Водитель) Тогда  // Тогда проверка на нового водителя
				Если ЗначениеЗаполнено(НовыйВодитель) Тогда
					//Проверяем это новый или нет
					Если НовыйВодитель<>Водитель Тогда
						
												
						Водитель=НовыйВодитель;
						ШКВодитель=ШКНовыйВодитель;
						Возврат;
					КонецЕсли;
									
				КонецЕсли;
			Иначе
				
				
				Водитель=НовыйВодитель;
				ШКВодитель=ШКНовыйВодитель;
                 Возврат;
			КонецЕсли;
		КонецЕсли;
		
		
		
		
		//Ищем документ 
		
		//Если Не ЗначениеЗаполнено(ШК) Тогда
		ШК = Лев(Данные, СтрДлина(Данные) - 1);
		Док = НайденныйДок(ШК);
		
		Если ЗначениеЗаполнено(Док) Тогда
			// Показать данные документа
	  		БЯС=Док;
		 	ЭтаФорма.ПутевойЛист=БЯС.ПутевойЛист;
			
			//Водитель=Док.ПутевойЛист.Водитель;
			//ШКВодитель= Док.ПутевойЛист.Водитель.Штрихкод;
			СчетФ=(Док.НомераСФ);
			//Сообщить(Док.Комментарий);
			КолКоробокБЯС=(Док.Коробки);	
			
			// Кол Если уже был вывоз
			ДокументПогрузкаВАвто = ПроверитьНаличиеДокумента(ШК);
			Если ЗначениеЗаполнено(ДокументПогрузкаВАвто) Тогда
				ДокПогрузкаВАвто=ДокументПогрузкаВАвто;
				Водитель=ДокументПогрузкаВАвто.Водитель;
				ШКВодитель= ДокументПогрузкаВАвто.Водитель.Штрихкод;

				КолКоробокВАвто= ДокументПогрузкаВАвто.КоличествоКоробок;
				//КолКоробок=КолКоробокБЯС-КолКоробокВАвто;	
				КолКоробок=КолКоробокВАвто;	
				//Проверка на полный вывоз
				Если КолКоробокВАвто =КолКоробокБЯС Тогда
					Сообщить("Документ полностью вывезен.");
					Возврат;
				КонецЕсли;
			Иначе	
				КолКоробокВАвто= 0;
				КолКоробок=КолКоробокБЯС;
				ДокПогрузкаВАвто="";
				
			КонецЕсли;
			
			
		Иначе
			ОчиститьСообщения();
			Сообщить("Документ не найден!!!");
			ШК = "";
			Сброс(Неопределено);
			Возврат;
		КонецЕсли;
		
		
	КонецЕсли;		
КонецПроцедуры


//**************************************************************//



&НаСервере
Функция НайтиФизЛицоПоШк(ШКФизЛицо,Должность)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Штрихкод = &Штрихкод
	|	И ФизическиеЛица.Должность В(&Должность)";
	
	Запрос.УстановитьПараметр("Штрихкод", ШКФизЛицо);
	
	Должности=Новый Массив;
	Если Должность="Водитель" Тогда
		Должности.Добавить(Справочники.Должности.Водитель);
		Должности.Добавить(Справочники.Должности.Филиал);
	ИначеЕсли Должность="РаботникОхраны" Тогда
		Должности.Добавить(Справочники.Должности.РаботникОхраны);
	КонецЕсли;
	Запрос.УстановитьПараметр("Должность", Должности);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
КонецФункции


&НаСервере
Функция ПроверитьНаличиеДокумента(ШК)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПогрузкаТоваровВАвтомобиль.Ссылка
	|ИЗ
	|	Документ.ПогрузкаТоваровВАвтомобиль КАК ПогрузкаТоваровВАвтомобиль
	|ГДЕ
	|	ПогрузкаТоваровВАвтомобиль.ДокументыРасхода.ШК = &ШК";
	Запрос.УстановитьПараметр("ШК", ШК);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе 
		Возврат Неопределено;
	КонецЕсли; 
	
	
КонецФункции

//&НаСервере
//Функция СоздатьДокументПогрузкаНаСервере()
//	НовыйДокументПриема = Документы.ПогрузкаТоваровВАвтомобиль.СоздатьДокумент();
//	Возврат НовыйДокументПриема.Ссылка;
//КонецФункции

&НаКлиенте
Процедура Сброс(Команда)
	Если Не СбросКромеОхраны Тогда
		РаботникОхраны="";
		ШКОхрана="";
		ШКВодитель="";
		Водитель="";

	КонецЕсли;
	
	ШК="";
	ШКАвтомобиль="";
		Автомобиль="";
	БЯС="";
	ПутевойЛист="";
	КолКоробок=0;
	СчетФ="";
	КолКоробокБЯС=0;
	КолКоробокВАвто=0;
	ДокПогрузкаВАвто="";
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СбросКромеОхраны=Истина;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	//Проверка На КолКоробок
	
	ЭтаФорма.ТекущийЭлемент=Элементы.ДокПогрузкаВАвто;
	Если КолКоробок=0 Тогда
		ЭтаФорма.ТекущийЭлемент=Элементы.КолКоробок;
       //	Сообщить("Заполните количество коробок.");
	   Предупреждение("Заполните количество коробок.");
		Возврат;	
	КонецЕсли;
	
	
	Если ШК="" Тогда
		Сообщить("Нет Данных.");
		Возврат;
	КонецЕсли;
	СохранитьСЕРВЕР();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСЕРВЕР()
	
	//Проверка на общее кол коробок
	//Если КолКоробокБЯС<(КолКоробок+КолКоробокВАвто)  Тогда
	//	Сообщить("ОШИБКА!. Сумма коробок в Авто и вывозимое больше чем в документе.");
	//	Возврат;
	//КонецЕсли;
	
	
	//Сохраняем (Создаем) документ  ПогрузкаТоваровВАвтомобиль
	Документ = ПроверитьНаличиеДокумента(ШК);
	Если Документ = Неопределено Тогда
		//Создаем Документ
		Документ=Документы.ПогрузкаТоваровВАвтомобиль.СоздатьДокумент();
		Документ.Дата =ТекущаяДата();
		Документ.Водитель=Водитель;
		Документ.РаботникОхраны=РаботникОхраны;
		Документ.Подразделение=БЯС.Организация;
		Документ.ПутевойЛист=ПутевойЛист;
		Документ.ДокументОснование=БЯС;
		Документ.Контрагент=БЯС.Получатель;
		Документ.КоличествоКоробок=КолКоробок;
		Документ.ДокументыРасхода.Загрузить(БЯС.ДокументыРасхода.Выгрузить());
		Документ.МестаОтгрузки.Загрузить(БЯС.МестаОтгрузки.Выгрузить());
						
	Иначе
		Документ=Документ.ПолучитьОбъект();
		Документ.Водитель=Водитель;
        Документ.ПутевойЛист=ПутевойЛист;
		//Документ.КоличествоКоробок=(КолКоробок+КолКоробокВАвто);
		//Сообщить(КолКоробок);
		Документ.КоличествоКоробок=КолКоробок;
	КонецЕсли;
	
		
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	
	//Ставим Дату Конца Отгрузки в БЯС
   	Попытка
		ДокБЯС=БЯС.ПолучитьОбъект();
		ДокБЯС.КонецОтгрузки=ТекущаяДата();
		ДокБЯС.ПогрузкаВАвто=Документ.Ссылка;	
		ДокБЯС.Записать(РежимЗаписиДокумента.Запись);
	Исключение
	КонецПопытки;
 	
	Сообщить("Данные Записаны.");
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьДокумент()
//ШК = Лев(Данные, СтрДлина(Данные) - 1);
		Док = НайденныйДок(ШК);
		
		Если ЗначениеЗаполнено(Док) Тогда
			// Показать данные документа
			БЯС=Док;
			ЭтаФорма.ПутевойЛист=БЯС.ПутевойЛист;
			//Водитель=Док.ПутевойЛист.Водитель;
			ШКВодитель= Док.ПутевойЛист.Водитель.Штрихкод;
			СчетФ=(Док.НомераСФ);
			//Сообщить(Док.Комментарий);
			КолКоробокБЯС=(Док.Коробки);	
			
			// Кол Если уже был вывоз
			ДокументПогрузкаВАвто = ПроверитьНаличиеДокумента(ШК);
			Если ЗначениеЗаполнено(ДокументПогрузкаВАвто) Тогда
				Водитель=ДокументПогрузкаВАвто.Водитель;
				КолКоробокВАвто= ДокументПогрузкаВАвто.КоличествоКоробок;
				//КолКоробок=КолКоробокБЯС-КолКоробокВАвто;	
				КолКоробок=КолКоробокВАвто;	
				//Проверка на полный вывоз
				Если КолКоробокВАвто =КолКоробокБЯС Тогда
					Сообщить("Документ полностью вывезен.");
					Возврат;
				КонецЕсли;
			Иначе	
				КолКоробокВАвто= 0;
				КолКоробок=КолКоробокБЯС;
			КонецЕсли;
			
			
		Иначе
			ОчиститьСообщения();
			Сообщить("Документ не найден!!!");
			ШК = "";
			Сброс(Неопределено);
			Возврат;
		КонецЕсли;
	
КонецПроцедуры

