
&НаКлиенте
Процедура Сотрудники(Команда)
	СотрудникиСЕРВЕР();
КонецПроцедуры

&НаСервере
Процедура СотрудникиСЕРВЕР()
		
	ТК.Очистить();
	ТК.ДобавитьСтроку("UNISTRING;NAME;PROF_ID;USE;PHONE;SMS_MESSAGE_TYPE_ID");
	//Добавляем Строки Сотрудников
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизическиеЛица.Код,
	|	ФизическиеЛица.Наименование,
	|	ФизическиеЛица.Должность,
	|	ФизическиеЛица.Автомобиль
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Должность = &Должность";
	
	Запрос.УстановитьПараметр("Должность", Справочники.Должности.Водитель);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стр=""+
		"'"+(ВыборкаДетальныеЗаписи.Код) + "';" +	//UNISTRING
		"'"+ВыборкаДетальныеЗаписи.Наименование + "';" +//NAME
		"2;"+			//PROF_ID
		"1;"+			//USE
		";"+			//PHONE
		";";			//SMS_MESSAGE_TYPE_ID
		
		ТК.ДобавитьСтроку(Стр);
	КонецЦикла;
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Автомобили(Команда)
	АвтомобилиСЕРВЕР();
КонецПроцедуры

&НаСервере
Процедура АвтомобилиСЕРВЕР()
	ТК.Очистить();
	ТК.ДобавитьСтроку("UNISTRING;NAME;NNUMBER;MAXWEIGHT;"+
	"MAXVOLUME;MAXPALLETE;CARUSED;GAS_ID;EXPENGAS0;EXPENGAS1;EXPENGAS01;EXPENGAS11;"+
	"TRUCK_PAS;GRUZTYP_ID;START_WORK;FINISH_WORK;SPEED;SPEEDOUT;NAEMNIY;VODITEL_ID;"+
	"EXPEDITOR_ID;ENTERPRISE_ID;TARIFH;USED_TARIF_KM0;TARIF_KM0;USED_TARIF_KM1;"+
	"TARIF_KM1;DISPATCH_CENTER_ID;");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Автомобили.Код,
	|	Автомобили.Наименование,
	|	Автомобили.ГосударственныйНомер,
	|	Автомобили.МаркаАвтомобиля,
	|	ФизическиеЛица.Код КАК ВодительКОд,
	|	ФизическиеЛица.Наименование КАК Водитель
	|ИЗ
	|	Справочник.Автомобили КАК Автомобили
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО ФизическиеЛица.Автомобиль = Автомобили.Ссылка";
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стр=""+
		"'"+ВыборкаДетальныеЗаписи.Код +"';"+	//UNISTRING
		"'"+ВыборкаДетальныеЗаписи.МаркаАвтомобиля +"';"+	//NAME
		"'"+ВыборкаДетальныеЗаписи.ГосударственныйНомер +"';"+	//NNUMBER
		";"+//MAXWEIGHT
		";"+//MAXVOLUME
		";"+//MAXPALLETE
		"1;"+//CARUSED
		";"+//GAS_ID
		";"+//EXPENGAS0
		";"+//EXPENGAS1
		";"+//EXPENGAS01
		";"+//EXPENGAS11
		"0;"+//TRUCK_PAS
		";"+//GRUZTYP_ID
		";"+//START_WORK
		";"+//FINISH_WORK
		";"+//SPEED
		";"+//SPEEDOUT
		";"+//NAEMNIY
		"'"+ВыборкаДетальныеЗаписи.ВодительКОд +"';"+//VODITEL_ID
		";"+//EXPEDITOR_ID
		";"+//ENTERPRISE_ID
		";"+//TARIFH
		";"+//USED_TARIF_KM0
		";"+//TARIF_KM0
		";"+//USED_TARIF_KM1
		";"+//TARIF_KM1
		"1;";//DISPATCH_CENTER_ID
		
		ТК.ДобавитьСтроку(Стр);
		
	КонецЦикла;
	
	
	
	
	
	
КонецПроцедуры



&НаКлиенте
Процедура РасходникиЗаПериод(Команда)
	
	ТК.Очистить();

	РасходникиЗаПериодСЕРВЕР();
	
КонецПроцедуры

&НаСервере
Процедура РасходникиЗаПериодСЕРВЕР()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	  "ВЫБРАТЬ
	 |	БольшаяЯчеистаяСборка.Ссылка
	 |ИЗ
	 |	Документ.БольшаяЯчеистаяСборка КАК БольшаяЯчеистаяСборка
	 |ГДЕ
	 |	БольшаяЯчеистаяСборка.Дата >= &ДатаН
	 |	И БольшаяЯчеистаяСборка.Дата <= &ДатаК";
	
	Запрос.УстановитьПараметр("ДатаК", ДатаК);
	Запрос.УстановитьПараметр("ДатаН", ДатаН);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	ТК.ДобавитьСтроку("UNISTRING;NUMBER_DOC;FROM_ID;TO_ID;DOC_DATE;"+
	"SUMMA;MASSA;OBEM;COMMENTS;QTY;DOCS_TYPE;INTERM_ID;"+
	"KOL_VO_PALLET;GRUZ_TYPE_ID;DELETED;TIME1;TIME2;AVAILABILITY_TIME;");

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВыгрузкаБЯССЕРВЕР(ВыборкаДетальныеЗаписи.Ссылка) ;

	КонецЦикла;

	

КонецПроцедуры


&НаКлиенте
Процедура Сохранить(Команда)
	//-------------------------------------
	Режим = РежимДиалогаВыбораФайла.Открытие;
ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
ДиалогОткрытияФайла.ПолноеИмяФайла = "";
Текст = "ru = ""Текст""; en = ""Text""";
Фильтр = НСтр(Текст)+"(*.csv)|*.csv";
ДиалогОткрытияФайла.Фильтр = Фильтр;
ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
ДиалогОткрытияФайла.Заголовок = "Выберите файл";
Если ДиалогОткрытияФайла.Выбрать() Тогда
    Путь = ДиалогОткрытияФайла.ПолноеИмяФайла;
Иначе
    Текст = "ru = ""Файл(ы) не выбран!""; en = ""File(s) not selected!""";
    Сообщить(НСтр(Текст));
КонецЕсли;

	//-------------------------------------
	  ТК.Записать(Путь,КодировкаТекста.Системная);
	   Сообщить("Файл Сохранен.- "+ Путь);

КонецПроцедуры


&НаКлиенте
Процедура Обзор(Команда)
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Путь="C:\Backup1C\docs.csv";
	ДатаН=НачалоДня(ТекущаяДата());
	ДатаК=КонецДня(ТекущаяДата());
	ДатаОстатков=ТекущаяДата();
КонецПроцедуры

&НаСервере
Процедура ВыгрузкаБЯССЕРВЕР(ДокБЯС)
	
//Сообщить(ДокБЯС);
	
	//ТК.ДобавитьСтроку("UNISTRING;NUMBER_DOC;FROM_ID;TO_ID;DOC_DATE;"+
	//"SUMMA;MASSA;OBEM;COMMENTS;QTY;DOCS_TYPE;INTERM_ID;"+
	//"KOL_VO_PALLET;GRUZ_TYPE_ID;DELETED;TIME1;TIME2;AVAILABILITY_TIME;");

		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.СчетФ,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.ДокНомер КАК Номер,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Комментарий,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.ДатаДокумента КАК Дата,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Количество,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Сумма,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.КолПозиций,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка.Получатель.Код КАК КонтрагентКод,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка.Организация,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Объем,
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Вес
	               |ИЗ
	               |	Документ.БольшаяЯчеистаяСборка.ДокументыРасхода КАК БольшаяЯчеистаяСборкаДокументыРасхода
	               |ГДЕ
	               |	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка = &Ссылка"	;
	
	
	
	Запрос.УстановитьПараметр("Ссылка",ДокБЯС);
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//------- TO_ID --------//
		
		ТО_ИД=ВыборкаДетальныеЗаписи.КонтрагентКод;
 
		найтиПризнакОКСИМЕД=Найти(ВыборкаДетальныеЗаписи.Номер,"*");
		Если найтиПризнакОКСИМЕД>0 Тогда
			ТО_ИД="ОКСИ"+Сред(ВыборкаДетальныеЗаписи.КонтрагентКод,4);
		КонецЕсли;
		
		найтиПризнакПРОЕКТ1000=Найти(ВыборкаДетальныеЗаписи.СчетФ,"*");
		Если найтиПризнакПРОЕКТ1000>0 Тогда
			ТО_ИД="ПрТ"+Сред(ВыборкаДетальныеЗаписи.КонтрагентКод,9);
		КонецЕсли;


		
		
		Стр=""+// Строка(ДокБЯС) +
		"'"+ВыборкаДетальныеЗаписи.Номер +"';"+	//UNISTRING
		"'"+ВыборкаДетальныеЗаписи.СчетФ +"';"+	//NUMBER_DOC
		"'"+ВыборкаДетальныеЗаписи.Организация +"';"+//FROM_ID
		"'"+ТО_ИД +"';"+	//TO_ID
		"'"+Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy") +"';"+	//DOC_DATE   Формат(ВыборкаДетальныеЗаписи.Дата,"ДФ=dd.MM.yyyy")
		""+Формат(ВыборкаДетальныеЗаписи.Сумма,"ЧДЦ=2; ЧГ=0") +";"+//SUMMA
		""+Формат(ВыборкаДетальныеЗаписи.Вес,"ЧДЦ=3; ЧГ=0") +";"+//MASSA
		""+Формат(ВыборкаДетальныеЗаписи.Объем,"ЧДЦ=3; ЧГ=0") +";"+//OBEM
		"'"+СтрЗаменить( ВыборкаДетальныеЗаписи.Комментарий,";", "") +"';"+	//COMMENTS
		""+Формат(ВыборкаДетальныеЗаписи.Количество,"ЧДЦ=0; ЧГ=0") +";"+//QTY
		"1;"+//DOCS_TYPE
		";"+//INTERM_ID
		";"+//KOL_VO_PALLET
		";"+//GRUZ_TYPE_ID
		";"+//DELETED
		";"+//TIME1
		";"+//TIME2
		";";//AVAILABILITY_TIME
		ТК.ДобавитьСтроку(Стр);
		
	КонецЦикла;
	
	 	
	
КонецПроцедуры


&НаКлиенте
Процедура СчетФактурыВЗонеОтгрузки(Команда)
	ТК.Очистить();
	СчетФактурыВЗонеОтгрузкиСЕРВЕР();
КонецПроцедуры


&НаСервере
Процедура СчетФактурыВЗонеОтгрузкиСЕРВЕР()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗонаОтгрузкиОстатки.ДокументПрихода КАК Ссылка,
		|	СУММА(ЗонаОтгрузкиОстатки.КоличествоКоробокОстаток) КАК КоличествоКоробокОстаток
		|ИЗ
		|	РегистрНакопления.ЗонаОтгрузки.Остатки(&ПЕРИОД, ДокументПрихода.Самовывоз = ЛОЖЬ) КАК ЗонаОтгрузкиОстатки
		|ГДЕ
		|	ЗонаОтгрузкиОстатки.КоличествоКоробокОстаток > 0
		|	И ЗонаОтгрузкиОстатки.НомерМестаОтгрузки.Палет = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗонаОтгрузкиОстатки.ДокументПрихода";

	Запрос.УстановитьПараметр("ПЕРИОД",ДатаОстатков);
		Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	ТК.ДобавитьСтроку("UNISTRING;NUMBER_DOC;FROM_ID;TO_ID;DOC_DATE;"+
	"SUMMA;MASSA;OBEM;COMMENTS;QTY;DOCS_TYPE;INTERM_ID;"+
	"KOL_VO_PALLET;GRUZ_TYPE_ID;DELETED;TIME1;TIME2;AVAILABILITY_TIME;");

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ВыгрузкаБЯССЕРВЕР(ВыборкаДетальныеЗаписи.Ссылка) ;
     		
	КонецЦикла;
 	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаПоРегламентномуЗаданию(Команда)
	омРегламентныеЗаданияСЕРВЕР.ВыгрузкаСчетФактурВФайл();
КонецПроцедуры


&НаКлиенте
Процедура СписокРасходныхОрдеровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДокБЯС=ПолучитьДокБЯСПоНомеру(Элементы.СписокРасходныхОрдеров.ТекущиеДанные.НомерДокБЯС,Элементы.СписокРасходныхОрдеров.ТекущиеДанные.ДатаДокБЯС);
	ОткрытьЗначение(ДокБЯС);
КонецПроцедуры

&НаСервере
Функция ПолучитьДокБЯСПоНомеру(НомерДок,ДатаДок)
	
	Возврат Документы.БольшаяЯчеистаяСборка.НайтиПоНомеру(НомерДок,ДатаДок);
КонецФункции

