
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Парам=Новый ПараметрыСоединенияВнешнегоИсточникаДанных;
	//Парам.СтрокаСоединения="DRIVER={SQL Server};SERVER=SRVGLOB;UID=askabc;PWD=!QAZ2wsx;DATABASE=SergeliNew";
	Парам.СтрокаСоединения=Константы.СтрокаСоединения_TRANSRAS.Получить();
	ВнешниеИсточникиДанных.TRANSRAS.УстановитьОбщиеПараметрыСоединения(Парам);
	Если  ВнешниеИсточникиДанных.SRVGLOB.ПолучитьСостояние()=СостояниеВнешнегоИсточникаДанных.Отключен Тогда
	ВнешниеИсточникиДанных.SRVGLOB.УстановитьСоединение();
	КонецЕсли;

	
	
	ДатаН=НачалоДня(ТекущаяДата());
	ДатаК=НачалоДня(ТекущаяДата());

	СписокРеестров.Параметры.УстановитьЗначениеПараметра("ДатаН",ДатаН);
	СписокРеестров.Параметры.УстановитьЗначениеПараметра("ДатаК",ДатаК);
	СписокСчетФактур.Параметры.УстановитьЗначениеПараметра("Реестр","");

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСписокРеестров(Команда)
	СписокРеестров.Параметры.УстановитьЗначениеПараметра("ДатаН",ДатаН);
	СписокРеестров.Параметры.УстановитьЗначениеПараметра("ДатаК",ДатаК);
КонецПроцедуры

&НаКлиенте
Процедура СписокРеестровПриАктивизацииСтроки(Элемент)
	
	СписокСчетФактур.Параметры.УстановитьЗначениеПараметра("Реестр",Элементы.СписокРеестров.ТекущиеДанные.ID);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВыделенныеРеестры(Команда)
		
Если Вопрос("Загрузить выделенные реестры?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
	Возврат;	
КонецЕсли;

	
	масИД=Элементы.СписокРеестров.ВыделенныеСтроки;
	Если масИД.Количество()=0 Тогда
		Сообщить("Ничего не выбрано.");
		Возврат;
	КонецЕсли;
	
	масДок=Новый Массив;
	
	Для Каждого эл_масИД Из масИД Цикл
		//Сообщить(Элементы.СписокДокВПутевыхЛистах.ДанныеСтроки(эл_масИД).ПутевойЛист);
	масДок.Добавить(Элементы.СписокРеестров.ДанныеСтроки(эл_масИД).ID);	
	КонецЦикла;
	 ЗагрузитьВыделенныеРеестрыСЕРВЕР(масДок);
	 

 КонецПроцедуры
 
   &НаСервере
   Процедура  ЗагрузитьВыделенныеРеестрыСЕРВЕР(масДок)
	   
	   Для Каждого эл_масДок Из масДок Цикл
			РезультатЗагрузки=модСерверПолныеПрава.ЗагрузитьРеестрИзДельфи(эл_масДок);
			Если ЗначениеЗаполнено(РезультатЗагрузки.Реестр) Тогда
				Сообщить("Реестр -"+эл_масДок +" загружен");
			Иначе
				Сообщить(РезультатЗагрузки.СообщениеОшибки);	
			КонецЕсли;
			
	   КонецЦикла;
	   
   КонецПроцедуры
   
