
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	//Перем ИДПользователя, СпрПользователейДляПоиска, СсылкаНаНайденногоПользователя;
	//   Если ТребуемыеПараметры = Неопределено Тогда
	//   Иначе
	//	   СпрПользователейДляПоиска = Справочники.Пользователи;
	//	   ИДПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
	//	   ПараметрыСеанса.ТекущийПользователь = Пользователи.ОпределитьТекущегоПользователя();//СпрПользователейДляПоиска.НайтиПоРеквизиту("ИДПользователя",ИДПользователя);
	//КонецЕсли;
	
	Пользователи.СинхронизироватьПользователейИПользователейБД();		
	ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоКоду(ПользователиИнформационнойБазы.ТекущийПользователь().Имя);

КонецПроцедуры


   
