
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗонаОтгрузкиОстатки.НомерМестаОтгрузки,
	               |	ЗонаОтгрузкиОстатки.ДокументПрихода,
	               |	ЗонаОтгрузкиОстатки.ВесОстаток,
	               |	ЗонаОтгрузкиОстатки.КоличествоКоробокОстаток,
	               |	ЗонаОтгрузкиОстатки.ОбъемОстаток
	               |ИЗ
	               |	РегистрНакопления.ЗонаОтгрузки.Остатки КАК ЗонаОтгрузкиОстатки
	               |ГДЕ
	               |	ЗонаОтгрузкиОстатки.НомерМестаОтгрузки.Палет = ЛОЖЬ";
	
	//Запрос.УстановитьПараметр("Код","" );
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Объект.ОстаткиНаЗоне.Очистить();
	Пока Выборка.Следующий() Цикл
		Стр=Объект.ОстаткиНаЗоне.Добавить();
	    БЯЗ=Выборка.ДокументПрихода;
		Стр.Клиент=БЯЗ.Получатель;
		Если БЯЗ.ВозвратВодителя тогда
			Стр.Возврат=Перечисления.ТипОтгрузки.ВозвратКлиента;
		ИначеЕсли БЯЗ.ВозвратПоставщику тогда
			Стр.Возврат=Перечисления.ТипОтгрузки.ВозвратПоставщику;
		Иначе 
			Стр.Возврат=Перечисления.ТипОтгрузки.Отгрузка;
			
		КонецЕсли;
		Стр.Фактуры=БЯЗ.НомераСФ;
		Стр.КолМест=БЯЗ.Коробки;
		Стр.ДатаРазмещения=БЯЗ.НачалоОтгрузки;
		Стр.Орган=БЯЗ.Организация;
		Стр.МестоНаЗоне=БЯЗ.СписокМестХранений;
	КонецЦикла;
	//Вставить содержимое обработчика
КонецПроцедуры

