
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ДокументБЯС)  Тогда
		Сообщить("Документ создается только на основании документа БольшаяЯчеистаяСборка");
		Отказ=Истина;
	КонецЕсли;
//***ННН***Проверка на Дублирование
Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//нет дублям
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СписаниеТовараСЗоныОтгрузки.Ссылка
	|ИЗ
	|	Документ.СписаниеТовараСЗоныОтгрузки КАК СписаниеТовараСЗоныОтгрузки
	|ГДЕ
	|	СписаниеТовараСЗоныОтгрузки.ДокументБЯС = &ДокументБЯС";
	
	Запрос.УстановитьПараметр("ДокументБЯС", Объект.ДокументБЯС);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Отказ = Истина;
		Сообщение=Новый СообщениеПользователю;
		Сообщение.Текст="Документ уже списан :" + Строка(Выборка.Ссылка);
		Сообщение.КлючДанных=Выборка.Ссылка;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	Объект.Дата = ТекущаяДата();
	
КонецЕсли;	

	
КонецПроцедуры
