
&НаКлиенте
Процедура ОбновитьДокументСДельфи(Команда)
	  Если Вопрос("Обновить документы с БАЗЫ ДЕЛЬФИ? Все данные по документам будут удалены.", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		Возврат;	  
	КонецЕсли;
	
	масИД=Элементы.Список.ВыделенныеСтроки;
	
	Для Каждого эл_масИД Из масИД Цикл
		 //Сообщить(эл_масИД.Ссылка);
		 ОбновитьДокументСДельфиСервер(эл_масИД.Ссылка.Номер);

	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьДокументСДельфиСервер(НомерРеестра)
	
	РезультатЗагрузки=модСерверПолныеПрава.ЗагрузитьРеестрИзДельфи(НомерРеестра);	
	
	Если ЗначениеЗаполнено(РезультатЗагрузки.Реестр) Тогда
		Сообщить("Реестр "+НомерРеестра+" обновлен.");

	Иначе
		Сообщить(РезультатЗагрузки.СообщениеОшибки);
	КонецЕсли;

КонецПроцедуры
