
&НаКлиенте
Процедура ЛицензионноеСоглашениеЯндексНажатие(Элемент)
	ЗапуститьПриложение("http://legal.yandex.ru/maps_api/");
КонецПроцедуры

&НаКлиенте
Процедура ЛицензионноеСоглашениеГуглНажатие(Элемент)
	ЗапуститьПриложение("https://developers.google.com/maps/terms?hl=ru-RU");
КонецПроцедуры

&НаКлиенте
Процедура ЛицензионноеСоглашениеРамблерНажатие(Элемент)
	ЗапуститьПриложение("http://help.rambler.ru/maps/karty-legal/1143/");
КонецПроцедуры

&НаКлиенте
Процедура ЯндексНажатие(Элемент)
	Объект.ТипКарты = 0;
	
	ПараметрыФормы = Новый Структура;  
 	ПараметрыФормы.Вставить("ТипКарты", Объект.ТипКарты);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ОткрытьФорму("Обработка.РаботаСКартами.Форма.ФормаУпр", ПараметрыФормы, ЭтаФорма, "Яндекс");
КонецПроцедуры

&НаКлиенте
Процедура ГуглНажатие(Элемент)
	Объект.ТипКарты = 1;
	
	ПараметрыФормы = Новый Структура;  
 	ПараметрыФормы.Вставить("ТипКарты", Объект.ТипКарты);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ОткрытьФорму("ВнешняяОбработка.РаботаСКартами.Форма.ФормаУпр", ПараметрыФормы, ЭтаФорма, "Гугл");
КонецПроцедуры

&НаКлиенте
Процедура РамблерНажатие(Элемент)
	Объект.ТипКарты = 3;
	
	ПараметрыФормы = Новый Структура;  
 	ПараметрыФормы.Вставить("ТипКарты", Объект.ТипКарты);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ОткрытьФорму("ВнешняяОбработка.РаботаСКартами.Форма.ФормаУпр", ПараметрыФормы, ЭтаФорма, "Рамблер");
КонецПроцедуры
