
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Макет=Обработки.ЗагрузитКоры.ПолучитьМакет("Макет");
	Все=Макет.ПолучитьОбласть("Весь");
	ТД.Вывести(Все);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитКоры(Команда)
		Ш=1;	
	Стр=1;	
	Пока Ш=1 Цикл
		КлиентКод="";
		Если не ТД.Область(Стр,1).Текст="" тогда
			Код=ТД.Область(Стр,1).Текст;
			КлиентКод=Код;
			Клиент=Справочники.Контрагенты.НайтиПоКоду(КлиентКод);
			Если ЗначениеЗаполнено(Клиент) тогда
				ОБКлиент= Клиент.ПолучитьОбъект();
				ОБКлиент.КорX=ТД.Область(Стр,2).Текст;
				ОБКлиент.КорY=ТД.Область(Стр,3).Текст;
				ОБКлиент.Записать();
			КонецЕсли;
				Стр=Стр+1;	
		Иначе
			Ш=0;	
		КонецЕсли;
	КонецЦикла; 	

КонецПроцедуры
