
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элементы.Список.ТекущиеДанные.ДокументПрихода);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	НаименованиеМестаОтгрузки=Параметры.НаименованиеМестаОтгрузки;
	Если Параметры.НаименованиеМестаОтгрузки="Ж4" Тогда
		НаименованиеМестаОтгрузки="Палет";	
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("НаименованиеМестаОтгрузки",НаименованиеМестаОтгрузки);

КонецПроцедуры


&НаКлиенте
Процедура СписатьТоварСЗоныОтгрузки(Команда)
	Если Вопрос("Списать выбранные товары с зоны отгрузки?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		Возврат;	
	КонецЕсли;
	
	масСтрок=Элементы.Список.ВыделенныеСтроки;
	Для Каждого идСтроки Из масСтрок Цикл
		//Сообщить(идСтроки);
		СписатьТоварСЗоныОтгрузкиСЕРВЕР(Элементы.Список.ДанныеСтроки(идСтроки).ДокументПрихода,Элементы.Список.ДанныеСтроки(идСтроки).КоличествоКоробокОстаток,Элементы.Список.ДанныеСтроки(идСтроки).НомерМестаОтгрузки);
		Сообщить("Документ - "+Элементы.Список.ДанныеСтроки(идСтроки).ДокументПрихода+" - Списан.");
	КонецЦикла;
	Элементы.Список.Обновить();	
КонецПроцедуры

&НаСервере
Процедура  СписатьТоварСЗоныОтгрузкиСЕРВЕР(ДокБЯС,КолКоробокСписания,МестоОтгрузки)
	
	//***ННН***Проверка на Дублирование
	//нет дублям
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	СписаниеТовараСЗоныОтгрузки.Ссылка
	//|ИЗ
	//|	Документ.СписаниеТовараСЗоныОтгрузки КАК СписаниеТовараСЗоныОтгрузки
	//|ГДЕ
	//|	СписаниеТовараСЗоныОтгрузки.ДокументБЯС = &ДокументБЯС";
	//
	//Запрос.УстановитьПараметр("ДокументБЯС", ДокБЯС);
	//
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Отказ = Истина;
	//	Сообщение=Новый СообщениеПользователю;
	//	Сообщение.Текст="Документ уже списан :" + Строка(Выборка.Ссылка);
	//	Сообщение.КлючДанных=Выборка.Ссылка;
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;
		

	новыйДок=Документы.СписаниеТовараСЗоныОтгрузки.СоздатьДокумент();
	новыйДок.ДокументБЯС=ДокБЯС;
	новыйДок.Дата=ТекущаяДата();
	новыйДок.КолКоробок=КолКоробокСписания;
	новыйДок.МестоОтгрузки=МестоОтгрузки;
	новыйДок.Записать(РежимЗаписиДокумента.Проведение);
	Сообщить("Документ СФ-"+ДокБЯС.номераСФ+" списан(ы)");
	
КонецПроцедуры

&НаКлиенте
Процедура ПродлитьХранениеВЗонеОтгрузки(Команда)
	 Если Вопрос("Продлить хранение выбранных товаров в зоне отгрузки?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		Возврат;	
	КонецЕсли;
	
	масСтрок=Элементы.Список.ВыделенныеСтроки;
	Для Каждого идСтроки Из масСтрок Цикл
		//Сообщить(идСтроки);
		ПродлитьХранениеВЗонеОтгрузкиСЕРВЕР(Элементы.Список.ДанныеСтроки(идСтроки).ДокументПрихода);
		Сообщить("Документ - "+Элементы.Список.ДанныеСтроки(идСтроки).ДокументПрихода+" - Продлен.");
	КонецЦикла;

	//ПродлитьХранениеВЗонеОтгрузкиСЕРВЕР(Элементы.Список.ТекущиеДанные.ДокументПрихода);
	Элементы.Список.Обновить();	
КонецПроцедуры

&НаСервере
Процедура  ПродлитьХранениеВЗонеОтгрузкиСЕРВЕР(докБЯС)
	  док=докБЯС.ПолучитьОбъект();
	  //док.Отладка= док.Отладка+" Продлено-НачалоОтгрузки-"+док.НачалоОтгрузки;
	  док.НачалоОтгрузки=ТекущаяДата();
	   док.Записать();
	  Сообщить("Начало отгрузки изменено на - "+ТекущаяДата());
КонецПроцедуры


&НаКлиенте
Процедура ОтменитьСписаниеТовара(Команда)
	Если Вопрос("Отменить списание выбранных товаров с зоны отгрузки?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		Возврат;	
	КонецЕсли;
	
	масСтрок=Элементы.Список.ВыделенныеСтроки;
	Для Каждого идСтроки Из масСтрок Цикл
		//Сообщить(идСтроки);
		ОтменитьСписаниеТовараСЕРВЕР(Элементы.Список.ДанныеСтроки(идСтроки).ДокументПрихода);
	КонецЦикла;
	Элементы.Список.Обновить();	

КонецПроцедуры

&НаСервере
Процедура ОтменитьСписаниеТовараСЕРВЕР(ДокБЯС)
	Если  Не ЗначениеЗаполнено(ДокБЯС.ДокументСписания) Тогда
		Сообщить("Отменять нечего-Документ не списывался.");
		Возврат;
	КонецЕсли;
	
	ДокБЯСобъект=ДокБЯС.ПолучитьОбъект();
	ДокСписания=ДокБЯС.ДокументСписания.ПолучитьОбъект();
	//ДокСписания=Документы.БольшаяЯчеистаяСборка.НайтиПоНомеру(1).ПолучитьОбъект();
	ДокСписания.УстановитьПометкуУдаления(Истина);
	ДокСписания.Записать();
	
	ДокБЯСобъект.ДокументСписания="";
	ДокБЯСобъект.Списан=Ложь;
	ДокБЯСобъект.Записать();
	Сообщить("Документ - "+ДокБЯС+" - Списание отменено.");
КонецПроцедуры
