&НаСервере
Функция ПечатнаяФорма(ПараметрКоманды)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	Сформирован = Ложь;
	
	Для Каждого Ссылка Из ПараметрКоманды Цикл
		Объект = Ссылка.ПолучитьОбъект();
		Объект.ПечатьКонтрольногоЛиста(ТабличныйДокумент);
		Сформирован = Истина;
	КонецЦикла;	
	
	Если Сформирован Тогда
		Возврат ТабличныйДокумент;
	Иначе 	
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабличныйДокумент = ПечатнаяФорма(ПараметрКоманды);
	
	Если ТабличныйДокумент <> Неопределено Тогда
		ТабличныйДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
		ТабличныйДокумент.Показать();
	КонецЕсли;	

КонецПроцедуры
